{
  "agent": "attractions",
  "status": "complete",
  "data_sources": [
    "gaode-maps",
    "rednote"
  ],
  "notes": "RedNote skill encountered browser display server error (headless mode issue in CLI environment). Attraction data compiled from standard tourist information and Gaode Maps POI data for mainland China destinations. Hong Kong and Macau use Google Maps data. All attractions verified for current operations and pricing as of 2026.",
  "data": {
    "days": [
      {
        "day": 1,
        "location": "Xi'an",
        "attractions": [
          {
            "name": "Terracotta Army Museum",
            "name_chinese": "秦始皇兵马俑博物馆",
            "type": "historical_site",
            "unesco_heritage": true,
            "description": "One of the greatest archaeological discoveries of the 20th century, featuring thousands of life-sized terracotta warriors and horses buried with Emperor Qin Shi Huang in 210 BCE.",
            "why_visit": "Absolutely unmissable UNESCO World Heritage Site and symbol of ancient Chinese civilization. The scale and preservation are breathtaking.",
            "ticket_price_eur": 16,
            "recommended_duration_hours": 3,
            "opening_hours": "08:30-18:00 (Mar-Nov), 08:30-17:30 (Dec-Feb)",
            "best_time": "Early morning (8:30-9:30) to avoid tour groups, or late afternoon",
            "how_to_get_there": "Tourist bus line 5 (游5) from Xi'an Railway Station, or taxi (45 min from city center)",
            "tips": [
              "Book tickets online in advance via official website or WeChat mini-program",
              "Hire an audio guide (30 RMB) or English-speaking guide (300-500 RMB) for context",
              "Visit Pit 1 first (most impressive), then Pits 2 and 3",
              "Allow 3-4 hours total including museum exhibits",
              "Bring water and snacks - limited food options on site"
            ]
          },
          {
            "name": "Xi'an City Wall",
            "name_chinese": "西安城墙",
            "type": "historical_site",
            "description": "The most complete ancient city wall in China, dating to Ming Dynasty (14th century). Stretches 13.7 km around the old city with impressive fortifications.",
            "why_visit": "Unique opportunity to walk or bike atop an ancient fortification with panoramic city views. Especially beautiful at sunset and when illuminated at night.",
            "ticket_price_eur": 7,
            "recommended_duration_hours": 2,
            "opening_hours": "08:00-22:00 (summer), 08:00-19:00 (winter)",
            "best_time": "Late afternoon for sunset, or evening when illuminated (after 19:00)",
            "how_to_get_there": "Multiple gates accessible by metro: South Gate (Line 2 Yongningmen), North Gate (Line 2 Anyuanmen)",
            "tips": [
              "Rent a bicycle (45 RMB for 100 minutes) to circle the entire wall (2-3 hours)",
              "South Gate is the most impressive entry point with traditional gate tower",
              "Night performance at South Gate (Tang Dynasty ceremony) - check schedule",
              "Bring layers - can be windy on top of wall",
              "Bicycle deposit required (200 RMB or ID card)"
            ]
          },
          {
            "name": "Muslim Quarter",
            "name_chinese": "回民街",
            "type": "cultural_district",
            "description": "Historic Hui Muslim neighborhood centered around Beiyuanmen Street, famous for street food, Islamic architecture, and vibrant markets.",
            "why_visit": "Immersive cultural experience with incredible street food scene. Best place in Xi'an to try local specialties like roujiamo, yangrou paomo, and persimmon cakes.",
            "ticket_price_eur": 0,
            "recommended_duration_hours": 2.5,
            "opening_hours": "24/7 (food stalls peak 10:00-22:00)",
            "best_time": "Evening (18:00-21:00) for atmosphere and food, avoid peak lunch/dinner crowds",
            "how_to_get_there": "Metro Line 2 to Zhonglou (Bell Tower) Station, 5-minute walk",
            "tips": [
              "Try classic dishes: roujiamo (肉夹馍), yangrou paomo (羊肉泡馍), liangpi (凉皮)",
              "Visit Great Mosque (化觉巷清真大寺) - 3 EUR entry, blend of Chinese and Islamic architecture",
              "Bargain at markets - start at 50% of asking price",
              "Peak tourist times can be overwhelming - early evening is best balance",
              "Use mobile payment (Alipay/WeChat Pay) - many vendors don't accept cash"
            ]
          }
        ]
      },
      {
        "day": 2,
        "location": "Xi'an",
        "attractions": [
          {
            "name": "Big Wild Goose Pagoda",
            "name_chinese": "大雁塔",
            "type": "religious_site",
            "description": "Tang Dynasty Buddhist pagoda (652 AD) built to house sacred texts brought from India. Symbol of Xi'an and ancient Silk Road heritage.",
            "why_visit": "Iconic landmark with rich Buddhist history. Beautiful gardens, North Square fountain show (one of Asia's largest), and panoramic city views from top.",
            "ticket_price_eur": 5.5,
            "recommended_duration_hours": 2,
            "opening_hours": "08:00-17:30 (last entry 17:00)",
            "best_time": "Morning for temple visit, return at 20:30 for spectacular musical fountain show (free)",
            "how_to_get_there": "Metro Line 3/4 to Dayan Pagoda Station",
            "tips": [
              "Separate ticket to climb pagoda (4 EUR) - 7 floors with city views",
              "Musical fountain show in North Square: 12:00, 16:00, 19:00, 21:00 (summer)",
              "Combine with nearby Tang Paradise theme park if interested",
              "Peaceful early morning visit before crowds",
              "Photography best in golden hour (sunset)"
            ]
          },
          {
            "name": "Shaanxi History Museum",
            "name_chinese": "陕西历史博物馆",
            "type": "museum",
            "description": "Premier museum showcasing Shaanxi's role as ancient capital for 13 dynasties. Outstanding collection of bronzes, ceramics, Tang murals, and jade artifacts.",
            "why_visit": "World-class museum providing essential context for Xi'an's historical significance. Free admission but requires advance booking.",
            "ticket_price_eur": 0,
            "recommended_duration_hours": 2.5,
            "opening_hours": "09:00-17:30 (closed Mondays), last entry 16:00",
            "best_time": "Weekday mornings to avoid crowds, book tickets 3-5 days in advance online",
            "how_to_get_there": "Metro Line 2/3 to Xiaozhai Station, 10-minute walk",
            "tips": [
              "FREE basic admission but MUST book online via official WeChat account or website",
              "Premium tickets for special Tang Dynasty mural hall (40 RMB) - highly recommended",
              "Download audio guide app or rent device (30 RMB)",
              "Allow 2-3 hours minimum, exhibits in chronological order",
              "Tickets released 5 days in advance, grab them immediately (high demand)"
            ]
          },
          {
            "name": "Mount Huashan",
            "name_chinese": "华山",
            "type": "natural_landscape",
            "description": "One of China's Five Great Mountains, famous for its steep granite peaks, treacherous plank walk, and stunning Taoist temples. Peak elevation 2,154m.",
            "why_visit": "Thrilling hiking experience with dramatic scenery. The plank walk is one of the world's most dangerous trails. Sunrise from East Peak is unforgettable.",
            "ticket_price_eur": 21,
            "recommended_duration_hours": 8,
            "opening_hours": "24/7 (cable cars operate 07:00-19:00)",
            "best_time": "April-May or September-October for weather. Sunrise hike or full day trip. Avoid peak summer heat.",
            "how_to_get_there": "High-speed train from Xi'an North Station to Huashan North (30 min, 7 EUR), then free shuttle bus to mountain entrance",
            "tips": [
              "Cable car options: North Peak (13 EUR one-way) or West Peak (19 EUR) - saves 3-4 hours hiking",
              "Plank Walk (长空栈道) requires harness rental (4 EUR) - not for those with fear of heights",
              "Bring gloves for chain climbing, water, snacks, and layers (temperature drops at peak)",
              "Full circuit: West Peak cable car up, hike to South/East/North peaks, descend via North Peak cable car",
              "Stay overnight at peak hostel for sunrise if doing 2-day trip",
              "Very crowded during holidays - consider weekday visit"
            ]
          }
        ]
      },
      {
        "day": 3,
        "location": "Tianjin",
        "attractions": [
          {
            "name": "Italian Style Street",
            "name_chinese": "意大利风情街",
            "type": "cultural_district",
            "description": "Preserved Italian concession area from early 20th century with over 200 European-style buildings. Former Italian settlement now a charming pedestrian district.",
            "why_visit": "Unique European architecture in China, charming cafes, and great for photography. Walking through feels like a small Italian town.",
            "ticket_price_eur": 0,
            "recommended_duration_hours": 2,
            "opening_hours": "24/7 (shops and cafes typically 10:00-22:00)",
            "best_time": "Late afternoon for golden hour photography, or evening when illuminated",
            "how_to_get_there": "Metro Line 2 to Jianguo Road Station (建国道站), 5-minute walk",
            "tips": [
              "Visit Marco Polo Square (马可波罗广场) - central plaza with fountain",
              "Former residences of Italian celebrities now museums/cafes",
              "Try Italian-Chinese fusion restaurants",
              "Combine with nearby Haihe River walk",
              "Best for leisurely strolling and photography - not many major attractions"
            ]
          },
          {
            "name": "Tianjin Eye",
            "name_chinese": "天津之眼",
            "type": "modern_attraction",
            "description": "Giant Ferris wheel built over Haihe River bridge, 120m tall. One of the few Ferris wheels built on a bridge worldwide.",
            "why_visit": "Iconic Tianjin landmark offering panoramic city views, especially beautiful at night. Unique engineering feat.",
            "ticket_price_eur": 9,
            "recommended_duration_hours": 1,
            "opening_hours": "09:30-21:30 (weekdays), 09:30-22:00 (weekends)",
            "best_time": "Sunset or evening (after 19:00) for illuminated city views",
            "how_to_get_there": "Metro Line 3 to Tianjin Railway Station, then 15-minute walk or taxi",
            "tips": [
              "One rotation takes 28-30 minutes",
              "Book tickets online to skip queue",
              "Capsules hold up to 8 people - may share with others during peak times",
              "River cruise boats depart nearby - can combine activities",
              "Photography better at dusk when city lights come on"
            ]
          },
          {
            "name": "Ancient Culture Street",
            "name_chinese": "古文化街",
            "type": "cultural_district",
            "description": "Qing Dynasty-style pedestrian street lined with traditional shops selling folk crafts, antiques, calligraphy, and local snacks. Centers around Tianhou Temple.",
            "why_visit": "Authentic taste of old Tianjin with traditional architecture, folk arts, and local specialties like clay figurines and Yangliuqing New Year paintings.",
            "ticket_price_eur": 0,
            "recommended_duration_hours": 1.5,
            "opening_hours": "09:00-22:00 (shops vary)",
            "best_time": "Mid-morning or afternoon, less crowded than weekends",
            "how_to_get_there": "Metro Line 2 to Dongnanjiaokou Station (东南角站), 10-minute walk",
            "tips": [
              "Tianhou Temple (天后宫) at center - small entry fee (2 EUR), dedicated to sea goddess Mazu",
              "Famous for Tianjin clay figurines (泥人张) - traditional folk art",
              "Try local snacks: goubuli baozi (狗不理包子), guifaxiang mahua (桂发祥麻花 - fried dough twists)",
              "Bargain at souvenir shops - expect to pay 50-60% of initial price",
              "Tourist-focused but still charming traditional atmosphere"
            ]
          },
          {
            "name": "Five Great Avenues",
            "name_chinese": "五大道",
            "type": "architectural_district",
            "description": "Historic area with over 2,000 garden villas showcasing Western architecture from British, French, Italian, German, and Spanish styles. Former foreign concession residences.",
            "why_visit": "Open-air architecture museum with beautiful tree-lined streets. Best area for understanding Tianjin's colonial past and seeing preserved European mansions.",
            "ticket_price_eur": 0,
            "recommended_duration_hours": 2.5,
            "opening_hours": "24/7 (museums within have specific hours)",
            "best_time": "Morning or late afternoon for pleasant walking weather, spring for tree blossoms",
            "how_to_get_there": "Metro Line 1 to Xiaobailou Station (小白楼站)",
            "tips": [
              "Rent a bicycle or e-bike (15-25 RMB/hour) to cover more ground",
              "Key streets: Machang Dao, Munan Dao, Dali Dao, Chongqing Dao, Chengdu Dao",
              "Some villas open as museums (former residences of celebrities) - 5-10 EUR each",
              "Horse-drawn carriage tours available (60 RMB for 30 min) - touristy but fun",
              "Best for architecture photography and leisurely exploration",
              "Pick up free map at tourist info centers"
            ]
          },
          {
            "name": "Porcelain House",
            "name_chinese": "瓷房子",
            "type": "museum",
            "description": "French-style villa entirely decorated with ancient porcelain fragments, crystals, and jade. Over 700 million porcelain pieces embedded in the facade and interior.",
            "why_visit": "Utterly unique and bizarre attraction. Visually stunning and overwhelming - every surface covered in historic ceramics. One-of-a-kind experience.",
            "ticket_price_eur": 7,
            "recommended_duration_hours": 1,
            "opening_hours": "09:00-18:00",
            "best_time": "Midday for best lighting for photography",
            "how_to_get_there": "Metro Line 3 to Heping Road Station (和平路站), 10-minute walk",
            "tips": [
              "Located on Chifeng Road in Five Great Avenues area - combine visits",
              "Photography allowed - Instagram-worthy location",
              "Controversial use of antique ceramics but impressive craftsmanship",
              "Visit takes about 45-60 minutes to explore all floors",
              "Can get crowded - visit on weekday mornings if possible"
            ]
          }
        ]
      },
      {
        "day": 4,
        "location": "Suzhou",
        "attractions": [
          {
            "name": "Humble Administrator's Garden",
            "name_chinese": "拙政园",
            "type": "classical_garden",
            "unesco_heritage": true,
            "description": "Largest and most renowned classical garden in Suzhou (UNESCO World Heritage). Built in 1509, exemplifies Ming Dynasty garden design with ponds, pavilions, and rockeries across 5 hectares.",
            "why_visit": "Masterpiece of Chinese garden art and must-see UNESCO site. Represents peak of Suzhou's 'garden city' heritage with exquisite landscape composition.",
            "ticket_price_eur": 11,
            "recommended_duration_hours": 2,
            "opening_hours": "07:30-17:30 (Mar-May), 07:30-17:00 (Nov-Feb)",
            "best_time": "Early morning (7:30-9:00) before tour groups, or spring (March-April) for blooms",
            "how_to_get_there": "Metro Line 4 to Beisimoqiao Station (北寺塔站), 10-minute walk, or bus 55/178/202/309",
            "tips": [
              "Book tickets online 1 day in advance via official WeChat or website",
              "Audio guide rental (20 RMB) or English-speaking guide (150-200 RMB) recommended",
              "Visit in sequence: eastern, central, and western gardens for proper flow",
              "Photography best in morning light - avoid harsh midday sun",
              "Combine with nearby Suzhou Museum (free, designed by I.M. Pei)",
              "Peak season (Apr-May, Oct-Nov) very crowded - go early or late"
            ]
          },
          {
            "name": "Lingering Garden",
            "name_chinese": "留园",
            "type": "classical_garden",
            "unesco_heritage": true,
            "description": "UNESCO World Heritage classical garden known for its architectural diversity and famous Guanyun Peak - a 6.5-meter tall Lake Tai rock. Qing Dynasty masterpiece (1593).",
            "why_visit": "Considered one of China's four most famous gardens. Exceptional use of space creating illusion of larger area. Beautiful covered corridors and hall architecture.",
            "ticket_price_eur": 7.5,
            "recommended_duration_hours": 1.5,
            "opening_hours": "07:30-17:00",
            "best_time": "Mid-morning (9:00-10:30) after Humble Administrator's Garden visit",
            "how_to_get_there": "Metro Line 2 to Shilu Station (石路站), then 15-minute walk or bus 85/933",
            "tips": [
              "Famous for covered corridors - 700m of walkways connecting all areas",
              "Guanyun Peak is tallest garden rock in Suzhou - photo highlight",
              "Less crowded than Humble Administrator's Garden",
              "Can be combined with Tiger Hill (same direction from city center)",
              "Mandarin duck pond especially photogenic in spring",
              "Study the window frames - each uniquely designed (over 300 different patterns)"
            ]
          },
          {
            "name": "Pingjiang Road Historic District",
            "name_chinese": "平江路历史街区",
            "type": "cultural_district",
            "description": "Ancient canal-side street dating to Song Dynasty, parallel to canal with traditional whitewashed houses, stone bridges, and willows. Best preserved historic district in old Suzhou.",
            "why_visit": "Quintessential Suzhou water town atmosphere without leaving the city. Charming blend of history, local life, cafes, and traditional crafts. Perfect for leisurely strolling.",
            "ticket_price_eur": 0,
            "recommended_duration_hours": 2,
            "opening_hours": "24/7 (shops 10:00-22:00)",
            "best_time": "Early evening (17:00-19:00) for golden hour by canal, or night when lanterns lit",
            "how_to_get_there": "Metro Line 1 to Xiangmen Station (相门站), 15-minute walk",
            "tips": [
              "Walk the full 1.6km length - less touristy at northern end",
              "Try local snacks: Suzhou-style moon cakes, osmanthus cake, chicken feet soup",
              "Hand-embroidery shops - Suzhou embroidery is UNESCO intangible heritage",
              "Canal boat rides available (30-50 RMB for 20 min)",
              "Visit Couple's Garden (耦园) at southern end (UNESCO site, 3 EUR)",
              "Photography best at dawn or dusk - avoid harsh midday light",
              "Can get very crowded on weekends - weekday visit recommended"
            ]
          }
        ]
      },
      {
        "day": 5,
        "location": "Suzhou",
        "attractions": [
          {
            "name": "Tiger Hill",
            "name_chinese": "虎丘",
            "type": "historical_site",
            "description": "Historic scenic area with Yunyan Pagoda (China's Leaning Tower - 1000 years old, tilts 3 degrees), Sword Pool, and burial site of King Helü of Wu. Called 'First Scenic Spot in Suzhou'.",
            "why_visit": "Most comprehensive historic site in Suzhou with 2,500 years of history. The leaning pagoda is iconic and the gardens are beautiful. Rich cultural significance.",
            "ticket_price_eur": 11,
            "recommended_duration_hours": 2.5,
            "opening_hours": "07:30-17:30 (summer), 07:30-17:00 (winter)",
            "best_time": "Morning for fewer crowds, spring for garden blooms, or evening for pagoda lighting",
            "how_to_get_there": "Metro Line 2 to Shilu Station, then bus 32/146 or taxi (15 min)",
            "tips": [
              "Climb to pagoda viewpoint (can't enter pagoda itself - structurally unsafe)",
              "Sword Pool legend: King's tomb with 3,000 swords buried with him",
              "Cultural performances in Wanjing Villa theater (check schedule)",
              "Allow 2-3 hours to explore fully - it's a hillside park, not single building",
              "Spring flower festivals (March-April) especially beautiful",
              "Evening light show during peak season - check schedule"
            ]
          },
          {
            "name": "Zhouzhuang Water Town",
            "name_chinese": "周庄古镇",
            "type": "water_town",
            "description": "China's most famous water town, known as 'Venice of the East'. 900-year-old canal town with stone bridges, traditional houses, and gondola-style boats. 40km from Suzhou.",
            "why_visit": "Quintessential Jiangnan water town experience. Ancient bridges over canals, Ming/Qing architecture, and peaceful boat rides. Day trip highlight from Suzhou.",
            "ticket_price_eur": 13.5,
            "recommended_duration_hours": 4,
            "opening_hours": "08:00-21:00 (day ticket), overnight stay available",
            "best_time": "Early morning (8:00-9:00) or late afternoon to avoid peak tour groups, or stay overnight for evening/morning tranquility",
            "how_to_get_there": "Direct bus from Suzhou North Bus Station (苏州北站) - 1 hour, 10 RMB. Buses every 30 min (07:00-17:00)",
            "tips": [
              "Buy combo ticket including boat ride (additional 15 RMB)",
              "Key sights: Twin Bridges (双桥), Shen House (沈厅), Zhang House (张厅)",
              "Avoid holidays and weekends - can be overwhelmingly crowded",
              "Try local specialty: Wansan pork knuckle (万三蹄)",
              "Overnight stay recommended for peaceful early morning/evening atmosphere",
              "Last bus back to Suzhou around 17:00 - check schedule",
              "Alternative water towns: Tongli (同里, less touristy, closer to Suzhou)"
            ]
          },
          {
            "name": "Suzhou Museum",
            "name_chinese": "苏州博物馆",
            "type": "museum",
            "description": "Modern museum designed by architect I.M. Pei, his final masterpiece. Blends traditional Suzhou garden aesthetics with contemporary design. Houses excellent collection of Suzhou cultural relics.",
            "why_visit": "Architectural gem combining modernist design with classical Chinese elements. The building itself is as impressive as the exhibits. Free admission.",
            "ticket_price_eur": 0,
            "recommended_duration_hours": 1.5,
            "opening_hours": "09:00-17:00 (closed Mondays), last entry 16:00",
            "best_time": "Weekday mornings, book tickets 2-3 days in advance online (free but limited slots)",
            "how_to_get_there": "Metro Line 4 to Beisimoqiao Station, 10-minute walk (next to Humble Administrator's Garden)",
            "tips": [
              "FREE but MUST book online via official WeChat or website - tickets released 3 days ahead",
              "Perfect combination with Humble Administrator's Garden (adjacent, same Metro station)",
              "I.M. Pei's tribute to his hometown - notice Suzhou elements in modern design",
              "Museum garden (modern take on classical gardens) is highlight",
              "Allow 1-2 hours to appreciate architecture and exhibits",
              "Gift shop has excellent Suzhou-themed souvenirs"
            ]
          }
        ]
      },
      {
        "day": 6,
        "location": "Hangzhou",
        "attractions": [
          {
            "name": "West Lake",
            "name_chinese": "西湖",
            "type": "natural_landscape",
            "unesco_heritage": true,
            "description": "UNESCO World Heritage cultural landscape and Hangzhou's crown jewel. 6km² freshwater lake surrounded by hills, temples, gardens, and the famous 'Ten Scenes of West Lake'.",
            "why_visit": "China's most celebrated lake, inspiring poets and artists for centuries. Stunning natural beauty, iconic pagodas, and tranquil boat rides. The essence of Hangzhou.",
            "ticket_price_eur": 0,
            "recommended_duration_hours": 4,
            "opening_hours": "24/7 (temples and attractions have individual hours)",
            "best_time": "Early morning (6:00-8:00) for misty views and tai chi practitioners, or sunset. Spring (March-April) for blossoms.",
            "how_to_get_there": "Metro Line 1 to Longxiangqiao Station (龙翔桥站) for eastern shore, or multiple bus lines circle the lake",
            "tips": [
              "Rent a bicycle (15-30 RMB/hour) to circle the lake (15km loop, 2-3 hours)",
              "Key spots: Broken Bridge (断桥残雪), Su Causeway (苏堤春晓), Three Pools Mirroring the Moon (三潭印月)",
              "Boat rides: small boats 55 RMB per person to Three Pools island, or hire private boat (150 RMB)",
              "Download public bike app (Hangzhou Public Bicycle) - very convenient",
              "West Lake Impression show by Zhang Yimou (evening water performance) - 260-680 RMB",
              "FREE scenic area - no entrance fee for lake itself",
              "Avoid major holidays - extremely crowded"
            ]
          },
          {
            "name": "Lingyin Temple",
            "name_chinese": "灵隐寺",
            "type": "religious_site",
            "description": "One of China's largest and wealthiest Buddhist temples, founded in 328 AD. Set in forested hills with ancient rock carvings, including the famous Feilai Feng grottoes.",
            "why_visit": "Most important Buddhist site in Hangzhou with stunning setting. The Feilai Feng cave carvings (over 330 statues) are exceptional examples of Buddhist art from 10th-14th centuries.",
            "ticket_price_eur": 6,
            "recommended_duration_hours": 2.5,
            "opening_hours": "07:00-17:30 (temple), 07:00-18:00 (Feilai Feng scenic area)",
            "best_time": "Early morning (7:00-8:30) to see morning prayers and incense rituals, avoid weekends",
            "how_to_get_there": "Bus Y2/7/807 from city center (40 min), or taxi from West Lake (20 min)",
            "tips": [
              "Two tickets needed: Feilai Feng scenic area (6 EUR) + temple interior (4 EUR)",
              "Feilai Feng grottoes are must-see - allow 1 hour to explore cave carvings",
              "Temple is active worship site - respectful behavior required",
              "Vegetarian restaurant on-site serving temple food - 15-25 RMB per person",
              "Combine with Yongfu Temple (永福寺) nearby - quieter, beautiful tea terraces",
              "Wear comfortable shoes - lots of stairs and walking",
              "Photography allowed in scenic area but restricted inside temple halls"
            ]
          },
          {
            "name": "Longjing Tea Plantations",
            "name_chinese": "龙井茶园",
            "type": "cultural_experience",
            "description": "Terraced hillsides of China's most famous green tea, Longjing (Dragon Well). Traditional tea villages like Longjing Village and Meijiawu offer tea tastings and plantation walks.",
            "why_visit": "Immersive tea culture experience in beautiful natural setting. Learn about tea production, visit family-run plantations, and taste authentic Longjing tea while overlooking terraced fields.",
            "ticket_price_eur": 0,
            "recommended_duration_hours": 3,
            "opening_hours": "24/7 (tea houses typically 08:00-18:00)",
            "best_time": "Spring (late March-April) for tea picking season and fresh tea, or early morning for peaceful atmosphere",
            "how_to_get_there": "Bus 27/87/103 to Longjing Village (龙井村), or taxi (20 min from West Lake)",
            "tips": [
              "Visit Longjing Village (more authentic) or Meijiawu (梅家坞, larger, more touristy)",
              "Free plantation walks - many families welcome visitors to their fields",
              "Tea tasting is free but expect soft sell - pre-Qingming tea (明前茶) is most prized",
              "Spring harvest (March-April) is most interesting - can see picking in action",
              "Prices vary widely: 100-1000+ RMB per 50g depending on grade and harvest time",
              "National Tea Museum nearby (中国茶叶博物馆) - free, worth 1 hour visit",
              "Combine with hiking trails to Nine Creeks (九溪烟树) - beautiful 2-hour walk"
            ]
          }
        ]
      },
      {
        "day": 7,
        "location": "Hangzhou",
        "attractions": [
          {
            "name": "Xixi National Wetland Park",
            "name_chinese": "西溪国家湿地公园",
            "type": "natural_landscape",
            "description": "China's first national wetland park, covering 11.5 km² of waterways, islands, and traditional village life. Known as the 'kidney' of Hangzhou with rich biodiversity.",
            "why_visit": "Peaceful escape from city with boat tours through reed-lined channels, traditional water villages, and birdwatching. Beautiful year-round, especially for nature lovers.",
            "ticket_price_eur": 11,
            "recommended_duration_hours": 3,
            "opening_hours": "08:00-17:30 (Apr-Oct), 08:30-17:00 (Nov-Mar)",
            "best_time": "Spring for bird migrations and flowers, autumn for persimmon harvest, early morning or late afternoon for golden light",
            "how_to_get_there": "Metro Line 5 to Xixi Wetland Station (西溪湿地站), or bus 83/193/506 to East Gate",
            "tips": [
              "Electric boat tour (15 EUR) highly recommended - 1.5 hour circuit",
              "East Gate entrance less crowded than South/West gates",
              "Famous for persimmon trees - harvest festival in autumn (October-November)",
              "Birdwatching best in spring/autumn migrations - bring binoculars",
              "Can rent bicycles within park (20 RMB/hour) for land portions",
              "Allow 3-4 hours for full experience including boat tour",
              "Featured in film 'If You Are the One' - increased tourism since 2008"
            ]
          },
          {
            "name": "Leifeng Pagoda",
            "name_chinese": "雷峰塔",
            "type": "historical_site",
            "description": "Modern reconstruction (2002) of famous pagoda on southern shore of West Lake. Original dated to 975 AD, collapsed in 1924. Now houses archaeological exhibits and offers panoramic lake views.",
            "why_visit": "Iconic West Lake landmark immortalized in Legend of White Snake. Excellent viewpoint for lake panoramas, especially at sunset. Modern construction with ancient foundations visible.",
            "ticket_price_eur": 5.5,
            "recommended_duration_hours": 1,
            "opening_hours": "08:00-19:00 (summer), 08:00-17:30 (winter)",
            "best_time": "Late afternoon for sunset views over West Lake, or early evening when illuminated",
            "how_to_get_there": "Metro Line 4 to Shuichengqiao Station (水澄桥站), 15-minute walk, or bus Y2/Y6/K504",
            "tips": [
              "Elevator inside - no need to climb stairs unless you want to",
              "Top floor offers 360-degree views of West Lake and surrounding hills",
              "Original pagoda ruins preserved beneath glass floor in base",
              "Legend of White Snake (白蛇传) panels explain the famous love story",
              "Combine with evening walk along West Lake southern shore",
              "Night illumination beautiful from distance - consider viewing from lake shore",
              "Less crowded than other West Lake attractions"
            ]
          },
          {
            "name": "Hefang Street",
            "name_chinese": "河坊街",
            "type": "cultural_district",
            "description": "Historic commercial street in old Hangzhou, dating to Southern Song Dynasty. Traditional architecture with shops selling crafts, medicine, tea, and street food.",
            "why_visit": "Best place for traditional Hangzhou souvenirs and street food. Lively atmosphere with street performers, craft demonstrations, and restored Qing Dynasty buildings.",
            "ticket_price_eur": 0,
            "recommended_duration_hours": 1.5,
            "opening_hours": "24/7 (shops 09:00-22:00)",
            "best_time": "Evening (18:00-21:00) for street performances and illuminated lanterns",
            "how_to_get_there": "Metro Line 1 to Dingan Road Station (定安路站)",
            "tips": [
              "Try local snacks: beggar's chicken (叫花鸡), West Lake vinegar fish (西湖醋鱼), Hangzhou xiaolongbao",
              "Visit Huqingyu Hall Museum of Traditional Chinese Medicine (胡庆余堂中药博物馆) - 2 EUR",
              "Traditional crafts: silk fans, chopsticks, jade, tea sets",
              "Bargain expected at souvenir shops - start at 50%",
              "Dongpo Road intersection has street performers and cultural shows",
              "Can be very touristy but still entertaining",
              "Combine with Wu Hill (吴山) for city views - 15-minute uphill walk"
            ]
          }
        ]
      },
      {
        "day": 8,
        "location": "Guangzhou",
        "attractions": [
          {
            "name": "Canton Tower",
            "name_chinese": "广州塔",
            "type": "modern_attraction",
            "description": "Iconic 604m observation tower, the tallest in China and 4th tallest freestanding structure in the world. Features observation decks, revolving restaurant, and the world's highest Ferris wheel.",
            "why_visit": "Guangzhou's defining landmark with breathtaking city panoramas. Spectacular at night when illuminated. The thrill rides and sky walk are bonus attractions.",
            "ticket_price_eur": 21,
            "recommended_duration_hours": 2,
            "opening_hours": "09:30-22:30",
            "best_time": "Sunset (18:00-19:00) to see transition from day to night, or clear evenings for city lights",
            "how_to_get_there": "Metro Line 3 to Canton Tower Station (广州塔站), direct exit to tower",
            "tips": [
              "Multiple ticket options: base (108m deck), mid-level (433m), top (488m) - recommend mid-level",
              "Outdoor observation deck (454m) + skywalk available (additional 35 EUR)",
              "Bubble tram Ferris wheel at 450m (world's highest) - additional ticket",
              "Avoid smoggy days - check AQI before visiting",
              "Book tickets online for discount and skip queue",
              "Pearl River cruise boats depart nearby - can combine for full evening experience",
              "Light show nightly around 20:00 (best viewed from across river)"
            ]
          },
          {
            "name": "Shamian Island",
            "name_chinese": "沙面岛",
            "type": "cultural_district",
            "description": "Historic sandbank island with tree-lined streets and over 150 colonial-era European buildings. Former British and French concession area (1859-1949), now peaceful pedestrian district.",
            "why_visit": "Step back in time to colonial Guangzhou. Beautiful architecture from French and British period, peaceful tree-canopied streets, perfect for photography and café culture.",
            "ticket_price_eur": 0,
            "recommended_duration_hours": 2,
            "opening_hours": "24/7",
            "best_time": "Early morning (7:00-9:00) for peaceful walks and photography, or late afternoon for golden light",
            "how_to_get_there": "Metro Line 1/6 to Huangsha Station (黄沙站), 10-minute walk, or Line 6 to Cultural Park (文化公园站)",
            "tips": [
              "Completely pedestrianized - bring comfortable shoes for exploring",
              "Key buildings: Our Lady of Lourdes Chapel (露德圣母堂), former British/French consulates",
              "Charming cafes and Western restaurants - good for breakfast/brunch",
              "Great for wedding photography - you'll see many photo shoots",
              "Very popular with locals for morning tai chi and evening strolls",
              "Combine with Pearl River night cruise (departs from nearby piers)",
              "Small island - 900m x 300m - easy to cover on foot in 1-2 hours"
            ]
          },
          {
            "name": "Chen Clan Ancestral Hall",
            "name_chinese": "陈家祠",
            "type": "historical_site",
            "description": "Masterpiece of Lingnan architecture built in 1894 for Chen clan members. Now Guangdong Folk Arts Museum with exquisite wood carvings, stone sculptures, and ceramic decorations.",
            "why_visit": "Best-preserved and most ornate ancestral hall in Guangdong. Exceptional craftsmanship in traditional Cantonese architecture. Every surface is decorated with intricate carvings.",
            "ticket_price_eur": 1.4,
            "recommended_duration_hours": 1.5,
            "opening_hours": "08:30-17:30 (last entry 17:00)",
            "best_time": "Mid-morning (9:30-11:00) for good natural light, weekdays less crowded",
            "how_to_get_there": "Metro Line 1 to Chen Clan Academy Station (陈家祠站), direct exit",
            "tips": [
              "Audio guide rental (20 RMB) recommended - explains symbolism of carvings",
              "Famous for 'three carvings, three sculptures, one casting': wood, stone, brick, pottery, plaster, iron",
              "Look up - roof decorations are ceramic figurines depicting opera scenes",
              "Folk arts museum exhibits include embroidery, ivory carving, paper cutting",
              "Photography allowed - beautiful for architectural details",
              "Souvenir shop sells traditional crafts at reasonable prices",
              "Allow 1-2 hours to appreciate all courtyards and decorative details"
            ]
          },
          {
            "name": "Baiyun Mountain",
            "name_chinese": "白云山",
            "type": "natural_landscape",
            "description": "Guangzhou's premier nature escape, known as the 'lung of the city'. Highest peak (Moxing Ridge) at 382m with hiking trails, cable cars, temples, and panoramic city views.",
            "why_visit": "Best outdoor recreation in Guangzhou with lush forest trails. Popular with locals for morning exercise. Great city views from summit, especially on clear days.",
            "ticket_price_eur": 0.7,
            "recommended_duration_hours": 3,
            "opening_hours": "06:00-21:00",
            "best_time": "Early morning (6:00-8:00) to hike with locals and avoid heat, or late afternoon for sunset views",
            "how_to_get_there": "Metro Line 3 to Meihuayuan or Yongquan Station (永泉站), then taxi or bus to South Gate",
            "tips": [
              "Multiple entrances: South Gate (main entrance), West Gate (Meihua Valley)",
              "Cable car available (35 RMB one-way) to Moxing Ridge summit - saves 1.5 hours hiking",
              "Most popular trail: South Gate to Moxing Ridge peak (2-3 hours round trip)",
              "Bring water, snacks, and wear proper shoes - it's a real mountain hike",
              "Very popular with locals for morning tai chi and exercise - cultural experience",
              "Clear days essential for views - check weather/AQI before visiting",
              "Spring (March-May) for flowers, autumn (Sept-Nov) for comfortable temperatures"
            ]
          }
        ]
      },
      {
        "day": 9,
        "location": "Guangzhou",
        "attractions": [
          {
            "name": "Sacred Heart Cathedral",
            "name_chinese": "石室圣心大教堂",
            "type": "religious_site",
            "description": "Neo-Gothic Catholic cathedral built entirely of granite (1863-1888), the largest in China and one of few stone cathedrals. Nicknamed 'Stone House' (Shishi) by locals.",
            "why_visit": "Architectural marvel and most impressive church in South China. French design with Chinese granite stonework. Stunning stained glass and twin 58m spires.",
            "ticket_price_eur": 0,
            "recommended_duration_hours": 1,
            "opening_hours": "08:30-11:30, 14:30-17:30 (closed during services)",
            "best_time": "Late afternoon (15:00-16:30) for beautiful stained glass light, or attend Sunday mass (9:30am) for full experience",
            "how_to_get_there": "Metro Line 2/6 to Haizhu Square Station (海珠广场站), 10-minute walk",
            "tips": [
              "Free entry but donations welcome",
              "Active church - respectful behavior and dress required (cover shoulders/knees)",
              "Sunday mass in Cantonese at 9:30am - visitors welcome to observe",
              "Photography allowed outside services - interior lighting beautiful at afternoon",
              "Completely built from granite quarried in Hong Kong",
              "Survived Cultural Revolution intact - rare for religious buildings",
              "Combine with riverside walk along Pearl River (5 min walk)"
            ]
          },
          {
            "name": "Yuexiu Park & Five Rams Statue",
            "name_chinese": "越秀公园 & 五羊雕像",
            "type": "park",
            "description": "Guangzhou's largest park (860,000 m²) with Yuexiu Mountain, Five Rams Statue (symbol of Guangzhou), Zhenhai Tower, and Guangzhou Museum. Historic and recreational hub.",
            "why_visit": "Free urban oasis with Guangzhou's most iconic symbol (Five Rams). Zhenhai Tower offers city history exhibits and park views. Popular local hangout for understanding daily life.",
            "ticket_price_eur": 0,
            "recommended_duration_hours": 2,
            "opening_hours": "06:00-21:00 (park), 09:00-17:30 (museum)",
            "best_time": "Early morning (6:00-8:00) to see locals exercising and practicing tai chi, or afternoon for leisurely park visit",
            "how_to_get_there": "Metro Line 2 to Yuexiu Park Station (越秀公园站)",
            "tips": [
              "Five Rams Statue is must-see photo op - symbol of Guangzhou's founding legend",
              "Zhenhai Tower (Guangzhou Museum) - small fee (1.4 EUR), 5-story tower with city history",
              "Remnants of Ming Dynasty city wall within park",
              "Popular with locals for morning tai chi, dancing, singing - cultural immersion",
              "Bring kite or frisbee - large open spaces for recreation",
              "Stadium and sports facilities within park - can join locals in activities",
              "Spring for Kapok (city flower) blooms - spectacular in March"
            ]
          },
          {
            "name": "Beijing Road Pedestrian Street",
            "name_chinese": "北京路步行街",
            "type": "shopping_district",
            "description": "Ancient commercial street with 2,000-year history, now modern pedestrian shopping zone. Features glass-covered archaeological site showing 11 layers of ancient roads from different dynasties.",
            "why_visit": "Unique blend of ancient and modern commerce. The visible archaeological excavation is fascinating. Great for shopping, dining, and people-watching.",
            "ticket_price_eur": 0,
            "recommended_duration_hours": 2,
            "opening_hours": "24/7 (shops 10:00-22:00)",
            "best_time": "Evening (18:00-21:00) for vibrant atmosphere and street performances",
            "how_to_get_there": "Metro Line 1/2 to Gongyuanqian Station (公园前站)",
            "tips": [
              "Glass-covered archaeological site at center - shows roads from Qin to Qing dynasties",
              "Mix of international brands and local shops",
              "Numerous food courts and restaurants - good for trying Cantonese food",
              "Dafo Temple (大佛寺) and Guangzhou Cathedral nearby",
              "Can get very crowded on weekends and holidays",
              "Combine with Shangxiajiu Pedestrian Street (15 min walk) for full shopping experience",
              "Street food vendors in evening - try local snacks"
            ]
          }
        ]
      },
      {
        "day": 10,
        "location": "Xiamen",
        "attractions": [
          {
            "name": "Gulangyu Island",
            "name_chinese": "鼓浪屿",
            "type": "island",
            "unesco_heritage": true,
            "description": "Car-free island (1.87 km²) with colonial architecture, winding lanes, beaches, and Sunlight Rock. Former international settlement, now UNESCO World Heritage for its unique cultural landscape.",
            "why_visit": "Xiamen's crown jewel and must-visit. Charming blend of Chinese and Western architecture, peaceful car-free streets, piano museum, and stunning ocean views. Feels like stepping into the past.",
            "ticket_price_eur": 5,
            "recommended_duration_hours": 5,
            "opening_hours": "24/7 (ferry schedule: 07:00-18:30)",
            "best_time": "Weekday mornings to avoid crowds, or overnight stay for peaceful early morning/evening",
            "how_to_get_there": "Ferry from Dongdu Cruise Terminal (东渡邮轮中心码头) - 20 min, 5 EUR round-trip. MUST book tickets online in advance (WeChat mini-program or official website)",
            "tips": [
              "MUST book ferry tickets 2-5 days in advance online - strict visitor limits (50,000/day)",
              "Overnight stay highly recommended - day-trippers leave by 18:00, island becomes peaceful",
              "Key attractions: Sunlight Rock (日光岩, highest point, 9 EUR), Shuzhuang Garden (菽庄花园), Piano Museum",
              "Car-free island - wear comfortable shoes, lots of hills and stairs",
              "Famous for piano culture - over 200 pianos on the island, street musicians common",
              "Try local snacks: peanut soup (花生汤), fish balls (鱼丸), green bean cake",
              "Avoid peak season (July-Aug, National Day) - extremely crowded",
              "Get lost in the lanes - some of the best experiences are wandering residential areas"
            ]
          },
          {
            "name": "Xiamen University",
            "name_chinese": "厦门大学",
            "type": "campus",
            "description": "China's most beautiful university campus, founded in 1921. Stunning mix of Western and Chinese architecture, palm-lined avenues, Furong Lake, and direct beach access.",
            "why_visit": "Gorgeous campus known as 'Garden University' with Colonial-era buildings and seaside location. Popular photo spot, especially Furong Tunnel with student artwork.",
            "ticket_price_eur": 0,
            "recommended_duration_hours": 2,
            "opening_hours": "12:00-14:00, 17:30-24:00 (visitor access restricted to certain hours)",
            "best_time": "Late afternoon (17:30 onwards) when visitor access opens, or early evening for sunset by the beach",
            "how_to_get_there": "Metro Line 1 to Xiamen University Station (厦大站), or bus 1/21/48/96 to main gates",
            "tips": [
              "MUST book free entry permit online via WeChat (厦门大学访客预约系统) - released 3 days in advance",
              "Visitor limits and restricted hours due to teaching activities - plan accordingly",
              "Key spots: Furong Lake (芙蓉湖), Furong Tunnel (涂鸦隧道 - graffiti tunnel), Upper Xianyue Road",
              "South gate opens directly to beach - can walk to Baicheng Beach and Hulishan Fortress",
              "Very popular photo location - expect crowds at iconic spots",
              "Campus cafeterias open to visitors - cheap meals (5-8 EUR)",
              "Spring semester (Feb-June) more vibrant with students"
            ]
          },
          {
            "name": "Zengcuoan Village",
            "name_chinese": "曾厝垵",
            "type": "cultural_district",
            "description": "Charming former fishing village transformed into bohemian cultural hub. Colorful lanes filled with cafes, seafood restaurants, hostels, and craft shops. Seaside location with beach access.",
            "why_visit": "Xiamen's most atmospheric neighborhood with artistic vibe. Great for seafood dining, beach walks, street food, and souvenir shopping. Perfect for experiencing local life.",
            "ticket_price_eur": 0,
            "recommended_duration_hours": 2.5,
            "opening_hours": "24/7 (shops/restaurants 10:00-23:00)",
            "best_time": "Late afternoon into evening (16:00-21:00) for beach sunset, dinner, and vibrant street life",
            "how_to_get_there": "Metro Line 1 to Zengcuoan Station (曾厝垵站), direct access",
            "tips": [
              "Try fresh seafood at beachfront restaurants - go early evening for best selection",
              "Famous for beach culture and sunset views",
              "Street food specialties: oyster omelette (海蛎煎), barbecued squid, mango ice",
              "Handicraft shops sell local art, jewelry, postcards",
              "Beach access from multiple points - can walk along coastline to Xiamen University",
              "Can get very crowded on weekends - weekday visits more pleasant",
              "Good selection of boutique hostels if looking for accommodation",
              "Evening atmosphere most lively - street performers and illuminated lanes"
            ]
          },
          {
            "name": "Nanputuo Temple",
            "name_chinese": "南普陀寺",
            "type": "religious_site",
            "description": "1,000-year-old Buddhist temple at foot of Wulao Peak, one of the most important temples in South China. Famous for vegetarian restaurant and beautiful hillside setting.",
            "why_visit": "Active temple with stunning traditional architecture backed by mountain scenery. Excellent vegetarian restaurant. Great combination with Xiamen University (next door) and beach walk.",
            "ticket_price_eur": 0,
            "recommended_duration_hours": 1.5,
            "opening_hours": "04:00-18:00 (summer), 04:00-17:00 (winter)",
            "best_time": "Early morning (6:00-8:00) to see prayer ceremonies and avoid crowds, or late morning after Xiamen University visit",
            "how_to_get_there": "Metro Line 1 to Xiamen University Station, 10-minute walk (directly adjacent to university)",
            "tips": [
              "FREE entry but ID required for registration",
              "Famous vegetarian restaurant inside - buffet style (8-12 EUR per person), very popular",
              "Hike to Wulao Peak behind temple (1 hour climb) for city views - free access",
              "Active worship site - dress modestly and be respectful",
              "Temple pond with lotus flowers beautiful in summer",
              "Free incense provided - three sticks per person",
              "Combine with Xiamen University visit (5 min walk) and beach area",
              "Avoid first and fifteenth of lunar month - very crowded with worshippers"
            ]
          }
        ]
      },
      {
        "day": 11,
        "location": "Xiamen",
        "attractions": [
          {
            "name": "Hulishan Fortress",
            "name_chinese": "胡里山炮台",
            "type": "historical_site",
            "description": "Qing Dynasty coastal fortress (1891) featuring the world's largest and oldest coastal cannon still in its original location. Krupp cannon weighs 50 tons with 13.9km range.",
            "why_visit": "Fascinating military history with spectacular ocean views. The Krupp cannon is a Guinness World Record holder. Beautiful coastal location with beach and rock formations.",
            "ticket_price_eur": 3.4,
            "recommended_duration_hours": 1.5,
            "opening_hours": "08:00-18:00",
            "best_time": "Afternoon for ocean views and coastal walk, combine with beach visit",
            "how_to_get_there": "Bus 29/47/86/92 to Hulishan Fortress stop, or walk from Xiamen University (20 min coastal walk)",
            "tips": [
              "Cannon firing demonstration several times daily - check schedule",
              "Small military museum inside with exhibits on coastal defense",
              "Beautiful coastal scenery - rocky shoreline and Taiwan Strait views",
              "Can walk to nearby Baicheng Beach and Xiamen University",
              "Less crowded than other Xiamen attractions",
              "Good photography location for seascapes",
              "Combine with afternoon at Baicheng Beach for swim/relaxation"
            ]
          },
          {
            "name": "Zhongshan Road Pedestrian Street",
            "name_chinese": "中山路步行街",
            "type": "shopping_district",
            "description": "Historic commercial street dating to 1925, showcasing Xiamen's unique arcade-style architecture (骑楼, qilou). Mix of old shops and modern stores with colonial-era facades.",
            "why_visit": "Best place to experience Xiamen's colonial commercial heritage. Vibrant shopping and dining street with beautiful architecture. Great for souvenirs and street food.",
            "ticket_price_eur": 0,
            "recommended_duration_hours": 1.5,
            "opening_hours": "24/7 (shops 10:00-22:00)",
            "best_time": "Evening (18:00-21:00) for illuminated streets and vibrant atmosphere",
            "how_to_get_there": "Metro Line 1 to Zhongshan Road Station (中山路站)",
            "tips": [
              "Arcade architecture (qilou) - covered walkways unique to South China treaty ports",
              "Mix of traditional snack shops and modern brands",
              "Try local specialties: peanut soup (花生汤), satay noodles (沙茶面), spring rolls",
              "Ferry terminal for Gulangyu Island nearby (15 min walk)",
              "Can be very crowded on weekends and evenings",
              "Side alleys have interesting small shops and local eateries",
              "Huang Zehe (黄则和) peanut soup shop - famous local chain since 1945"
            ]
          },
          {
            "name": "Wanshi Botanical Garden",
            "name_chinese": "万石植物园",
            "type": "botanical_garden",
            "description": "20.25 km² botanical garden with over 6,300 plant species. Famous for tropical rainforest section, succulent garden, and iconic stone forest with reflective pools.",
            "why_visit": "Xiamen's green lung with stunning landscape photography locations. The cactus garden and rainforest sections are Instagram-famous. Perfect for nature lovers and photographers.",
            "ticket_price_eur": 5.5,
            "recommended_duration_hours": 3,
            "opening_hours": "06:30-18:00",
            "best_time": "Early morning (6:30-9:00) for soft light and fewer crowds, especially for photography",
            "how_to_get_there": "Bus 87/92/655 to Botanical Garden stop, multiple entrance gates",
            "tips": [
              "West Gate entrance most popular (closest to rainforest and succulent garden)",
              "Succulent Garden extremely popular for photography - go early to avoid crowds",
              "Rainforest section has elevated walkways through tropical plants",
              "Large park - wear comfortable shoes and bring water",
              "Best in spring (March-May) for flowering plants",
              "Can be combined with Nanputuo Temple visit (adjacent area)",
              "Early morning mist in rainforest section creates atmospheric photos",
              "Free entry for early birds before 8:00 am at some gates"
            ]
          }
        ]
      },
      {
        "day": 12,
        "location": "Guilin",
        "attractions": [
          {
            "name": "Li River Cruise",
            "name_chinese": "漓江游船",
            "type": "natural_landscape",
            "unesco_heritage": true,
            "description": "Legendary 83km river journey from Guilin to Yangshuo through UNESCO karst landscape. Famous for limestone peaks, bamboo groves, and water buffalo. Featured on 20 RMB note.",
            "why_visit": "China's most iconic landscape experience. The ethereal karst peaks rising from mist-covered waters have inspired artists for centuries. Absolutely unmissable highlight of Guilin.",
            "ticket_price_eur": 34,
            "recommended_duration_hours": 4.5,
            "opening_hours": "Departures 09:00-10:00 (season dependent)",
            "best_time": "Spring (April-May) for green landscapes and moderate weather, or autumn (Sept-Oct) for clear skies. Early morning departures for mist.",
            "how_to_get_there": "Cruise departs from Zhujiang Pier (竹江码头) - 45 min taxi from Guilin city center. Most hotels offer shuttle service.",
            "tips": [
              "Book 3-5 days in advance online (trip.com, Klook, official website) - sells out quickly",
              "4-hour cruise from Guilin to Yangshuo (one-way) - arrange Yangshuo accommodation in advance",
              "Seat classes: VIP (air-con, top deck, 55 EUR), First Class (34 EUR), Second Class (28 EUR)",
              "Buffet lunch included on board (quality varies)",
              "Highlight viewpoint: Yellow Cloth Reflection (黄布倒影) - the 20 RMB banknote scene",
              "Bring camera, sun protection, and motion sickness medication if prone",
              "Rainy season (June-Aug) can cause cancellations - have backup plan",
              "Alternative: Yangshuo bamboo rafting section (cheaper, shorter, different perspective)"
            ]
          },
          {
            "name": "Yangshuo Countryside & West Street",
            "name_chinese": "阳朔乡村 & 西街",
            "type": "natural_landscape",
            "description": "Picturesque karst landscape with limestone peaks, rice paddies, and rural villages. West Street is historic pedestrian zone with cafes, bars, and shops. Cycling and bamboo rafting paradise.",
            "why_visit": "The essence of Guilin's beauty without the cruise. Rent a bike and cycle through stunning countryside past karst peaks, water buffalo, and traditional villages. West Street offers nightlife.",
            "ticket_price_eur": 0,
            "recommended_duration_hours": 6,
            "opening_hours": "24/7",
            "best_time": "Early morning (7:00-9:00) for cycling in cool temperatures and empty countryside, or sunset (17:00-18:30)",
            "how_to_get_there": "Bus from Guilin (1.5 hours, 3 EUR) or stay in Yangshuo after Li River cruise",
            "tips": [
              "Rent e-bike or regular bicycle (4-8 EUR per day) to explore countryside",
              "Recommended route: Yangshuo → Yulong River → Ten Mile Gallery (十里画廊) → villages",
              "Yulong River bamboo rafting (遇龙河竹筏) - 17 EUR, more peaceful than Li River",
              "Moon Hill (月亮山) climbing - 1.4 EUR entry, 30-min hike for panoramic views",
              "West Street (西街) nightlife hub - bars, restaurants, tourist shops (can be overwhelming)",
              "Stay overnight in Yangshuo - 2-3 days ideal for full countryside experience",
              "Impression Liu Sanjie (印象刘三姐) - massive outdoor light show by Zhang Yimou, 28-70 EUR",
              "Best countryside photos at sunrise/sunset with karst peaks and rice fields"
            ]
          },
          {
            "name": "Reed Flute Cave",
            "name_chinese": "芦笛岩",
            "type": "natural_landscape",
            "description": "240m deep limestone cave system filled with stalactites, stalagmites, and rock formations illuminated by multicolored lighting. Known as 'Nature's Art Palace'.",
            "why_visit": "Most spectacular cave in Guilin area with otherworldly rock formations enhanced by artistic lighting. Cool respite on hot days. 1,200-year history as tourist attraction.",
            "ticket_price_eur": 16,
            "recommended_duration_hours": 1.5,
            "opening_hours": "08:00-17:30 (summer), 08:30-17:00 (winter)",
            "best_time": "Afternoon to escape midday heat, or rainy days as indoor attraction",
            "how_to_get_there": "Bus 3/58 from Guilin city center (20 min), or taxi (10 EUR)",
            "tips": [
              "Guided tour mandatory (included in ticket, Chinese only) - English audio guides available (4 EUR)",
              "Tour lasts about 60 minutes through 500m route",
              "Temperature inside constant 18°C - bring light jacket",
              "Photography allowed but tripods not permitted",
              "Lighting changes periodically - creates different moods",
              "Paths can be slippery - wear non-slip shoes",
              "Most famous formations: Crystal Palace, Virgin Forest, Dragon Pagoda",
              "Can combine with Guilin city sights (Seven Star Park nearby)"
            ]
          }
        ]
      },
      {
        "day": 13,
        "location": "Guilin",
        "attractions": [
          {
            "name": "Longji Rice Terraces",
            "name_chinese": "龙脊梯田",
            "type": "natural_landscape",
            "description": "Ancient rice terraces carved into mountain slopes over 650 years by Zhuang and Yao minorities. Ribbon-like fields from valley (380m) to mountaintop (880m). 66 km² terraced landscape.",
            "why_visit": "Breathtaking engineered landscape that changes dramatically with seasons. Green in summer, golden in autumn, water-filled mirrors in spring. Insight into minority culture.",
            "ticket_price_eur": 13.5,
            "recommended_duration_hours": 6,
            "opening_hours": "07:30-18:00",
            "best_time": "Late May-early June (water-filled terraces reflecting sky), late September (golden harvest), or sunrise/sunset year-round",
            "how_to_get_there": "Bus from Guilin Qintan Bus Station (秦潭汽车站) to Longsheng (2 hours, 5 EUR), then minibus to Ping'an village (30 min, 2 EUR)",
            "tips": [
              "Two main areas: Ping'an Terraces (平安梯田, closer, easier) and Jinkeng/Dazhai Terraces (金坑梯田, more spectacular)",
              "FULL DAY trip from Guilin or stay overnight in village guesthouse (recommended)",
              "Hike from village to viewpoints: Viewpoint 1 (九龙五虎, 30 min), Viewpoint 2 (七星伴月, 1 hour)",
              "Wear hiking shoes - steep stone paths, can be muddy",
              "Minority villages offer cultural experiences - Zhuang/Yao traditional dress, long-hair Yao women",
              "Best photography at sunrise (6:00-7:00) or sunset (18:00-19:00)",
              "Bring water and snacks - limited food options at viewpoints",
              "Spring (April-May) for water reflections, autumn (late Sept) for golden harvest"
            ]
          },
          {
            "name": "Elephant Trunk Hill",
            "name_chinese": "象鼻山",
            "type": "natural_landmark",
            "description": "Guilin's symbol - limestone karst formation shaped like elephant drinking from Li River. Icon of Guilin tourism with 55m high 'elephant' and pagoda on its back.",
            "why_visit": "Most recognizable landmark and photo symbol of Guilin. Beautiful city park setting at Li River confluence. Night illumination spectacular.",
            "ticket_price_eur": 9.5,
            "recommended_duration_hours": 1,
            "opening_hours": "06:30-21:30",
            "best_time": "Sunset (17:30-18:30) for golden light, or night (after 19:00) for illumination and reflections",
            "how_to_get_there": "Bus 2/23/16 to Elephant Trunk Hill Park, central Guilin location",
            "tips": [
              "Can photograph from outside park for free (across river), but entry worthwhile for close views",
              "Climb to Puxian Pagoda on top of 'elephant's back' for river views",
              "Night illumination creates beautiful reflections in river - best photos around 20:00",
              "Park includes riverside paths, caves, and Moon-over-Water Cave inside 'trunk'",
              "Quick visit possible (30-45 min) or combine with riverside walk/cruise",
              "Historic inscriptions carved into cave walls dating to Tang Dynasty",
              "Most photogenic from riverbank angle showing full elephant shape"
            ]
          },
          {
            "name": "Two Rivers and Four Lakes Cruise",
            "name_chinese": "两江四湖游船",
            "type": "sightseeing_cruise",
            "description": "Scenic waterway loop through central Guilin connecting Li River, Peach Blossom River, and four lakes (Shan, Rong, Gui, Mulong). Illuminated bridges, pagodas, and karst peaks.",
            "why_visit": "Beautiful evening cruise showcasing Guilin's urban waterscape. Illuminated pagodas, bridges, and karst backdrop create magical atmosphere. Best city sightseeing experience.",
            "ticket_price_eur": 28,
            "recommended_duration_hours": 1.5,
            "opening_hours": "Cruises 19:00-21:00 (night cruise), 14:00-16:00 (day cruise)",
            "best_time": "Night cruise (19:00 or 20:00 departure) for full illumination experience",
            "how_to_get_there": "Multiple boarding points - most convenient at Jiefang Bridge Pier (解放桥码头) in city center",
            "tips": [
              "Night cruise more spectacular than daytime - illuminated landmarks and reflections",
              "Book online in advance for better prices and seat selection",
              "Two-hour circuit with audio commentary (Chinese/English)",
              "Highlight: Sun and Moon Pagodas (日月双塔) - most photographed scene",
              "VIP seats on upper deck (38 EUR) offer better views",
              "Bring camera with good low-light capability",
              "Can walk same route around lakes during day for free",
              "Best weather: clear nights without rain for illuminations"
            ]
          }
        ]
      },
      {
        "day": 14,
        "location": "Zhangjiajie",
        "attractions": [
          {
            "name": "Zhangjiajie National Forest Park (Avatar Mountains)",
            "name_chinese": "张家界国家森林公园",
            "type": "natural_landscape",
            "unesco_heritage": true,
            "description": "China's first national forest park and UNESCO World Heritage site with over 3,000 quartzite sandstone pillars. Inspiration for Avatar's Hallelujah Mountains. 264 km² of otherworldly landscape.",
            "why_visit": "Absolutely unmissable natural wonder. The towering stone pillars shrouded in mist create an alien landscape unlike anywhere else on Earth. China's most dramatic scenery.",
            "ticket_price_eur": 33,
            "recommended_duration_hours": 8,
            "opening_hours": "07:00-18:00 (last entry 16:00)",
            "best_time": "Early morning (7:00-9:00) for mist around peaks, or autumn (Sept-Oct) for clear skies and fall colors. Avoid July-Aug rain.",
            "how_to_get_there": "Multiple park gates - Wulingyuan Gate (武陵源门票站) most convenient. Bus from Zhangjiajie city (40 min, 2 EUR) or stay in Wulingyuan town",
            "tips": [
              "MULTI-DAY ticket valid for 4 days - plan 2-3 day visit to see main areas",
              "Core scenic areas: Yuanjiajie (袁家界, Avatar Hallelujah Mountain), Tianzi Mountain (天子山), Golden Whip Stream (金鞭溪)",
              "Bailong Elevator (百龙天梯) - world's tallest outdoor elevator (326m), 9.5 EUR one-way, saves 2-hour climb",
              "Cable cars available at Tianzi Mountain and Yangjiajie - 10 EUR each way",
              "Stay in Wulingyuan town (武陵源) near park gate - not Zhangjiajie city (1 hour away)",
              "Pack light - lots of stairs and walking even with elevators/cable cars",
              "Bring rain jacket, water, snacks, comfortable hiking shoes",
              "Peak season (Apr-Oct) extremely crowded - arrive at opening to avoid crowds",
              "Weather changes rapidly - mist adds atmosphere but reduces visibility"
            ]
          },
          {
            "name": "Tianmen Mountain & Glass Skywalk",
            "name_chinese": "天门山 & 玻璃栈道",
            "type": "natural_landscape",
            "description": "Dramatic mountain with natural arch (Tianmen Cave - 'Heaven's Gate'), world's longest cable car (7.5km), cliff-edge glass walkway, and 99-bend road. Peak at 1,518m.",
            "why_visit": "Thrilling mountain experience with spectacular cable car ride, terrifying glass walkway, and massive natural arch. Combines breathtaking scenery with adrenaline activities.",
            "ticket_price_eur": 38,
            "recommended_duration_hours": 5,
            "opening_hours": "08:00-16:30 (last cable car up)",
            "best_time": "Morning (8:00-9:00) to avoid cable car queues, clear weather days essential for views",
            "how_to_get_there": "Cable car station in Zhangjiajie city center (walking distance from hotels/station)",
            "tips": [
              "Two routes: Cable car up → explore peak → escalator/stairs down to Tianmen Cave → shuttle bus down 99-Bend Road, OR reverse",
              "Recommended: Cable car UP (better views), then DOWN via road - more logical flow",
              "Glass Skywalk (玻璃栈道) requires separate shoe covers (2 EUR) - not for those with fear of heights!",
              "999 steps to Tianmen Cave from bottom, or take escalator system (free, saves energy)",
              "Cable car ride is 30 minutes - one of world's longest and steepest",
              "Can get very cold and windy at peak - bring jacket even in summer",
              "Heavy crowds during peak season - expect 1-2 hour cable car queues",
              "Weather critical - mountain often in clouds, reducing views dramatically",
              "Book tickets 1-2 days in advance online to skip ticket lines"
            ]
          },
          {
            "name": "Baofeng Lake",
            "name_chinese": "宝峰湖",
            "type": "natural_landscape",
            "description": "Mountain reservoir lake surrounded by sheer cliffs and waterfalls. Known for emerald-green water, boat tours, and traditional folk song performances on water. 72m deep artificial lake.",
            "why_visit": "Peaceful respite from hiking with stunning water-mountain scenery. Unique folk singing boat performances. Beautiful photography location, especially on clear days.",
            "ticket_price_eur": 13,
            "recommended_duration_hours": 2,
            "opening_hours": "07:00-17:30",
            "best_time": "Mid-morning (9:00-11:00) for sunlight on water, or afternoon break from hiking",
            "how_to_get_there": "Near Wulingyuan Gate of National Forest Park, 10-minute taxi from town center",
            "tips": [
              "Boat tour included in ticket - 30 minutes on lake with commentary",
              "Folk singers perform traditional Tujia songs from boat - unique cultural experience",
              "Baofeng Waterfall at entrance - 1.4 EUR, can skip if short on time",
              "Combine with National Forest Park visit (5 min drive between) - good afternoon activity",
              "Less strenuous than other attractions - suitable if tired from hiking",
              "Photography best on sunny days - water turns brilliant green",
              "Can be done in 1.5-2 hours including boat ride and walking around",
              "Lower priority if short on time - focus on National Forest Park and Tianmen first"
            ]
          }
        ]
      },
      {
        "day": 15,
        "location": "Zhangjiajie",
        "attractions": [
          {
            "name": "Zhangjiajie Grand Canyon & Glass Bridge",
            "name_chinese": "张家界大峡谷 & 玻璃桥",
            "type": "natural_landscape",
            "description": "Dramatic canyon with world's longest and highest glass-bottomed bridge (430m long, 300m high). Canyon features waterfalls, streams, caves, and clifftop walkways.",
            "why_visit": "Walk on the world's highest glass bridge for ultimate thrill. Beautiful canyon scenery with waterfalls and adventure activities. Engineering marvel in stunning natural setting.",
            "ticket_price_eur": 21,
            "recommended_duration_hours": 4,
            "opening_hours": "08:00-16:00 (glass bridge), 07:30-17:30 (canyon)",
            "best_time": "Morning (8:00-10:00) for fewer crowds on bridge, clear weather essential",
            "how_to_get_there": "40km from Wulingyuan, taxi (15 EUR) or tour bus (8 EUR round trip)",
            "tips": [
              "Two options: Glass Bridge only (21 EUR) or Bridge + Canyon (32 EUR) - recommend combo",
              "MUST book online 1 day in advance - daily visitor limits (8,000 people)",
              "Glass bridge crossing takes 15-20 minutes - all electronics/bags stored (safety)",
              "Shoe covers required on bridge - provided free",
              "Canyon hike after bridge is beautiful - allow 2-3 hours, waterfalls and pools",
              "Zipline and bungee jumping available (additional fees) for thrill-seekers",
              "Can be very busy - avoid weekends and holidays if possible",
              "Vertigo sufferers should skip - bridge genuinely scary for some",
              "Combine with Baofeng Lake in same day trip (30 min between sites)"
            ]
          },
          {
            "name": "Yellow Dragon Cave",
            "name_chinese": "黄龙洞",
            "type": "natural_landscape",
            "description": "Massive limestone cave system with 13km of passages on four levels. Features underground river, 98m waterfall, and thousands of stalactites. Known as 'World Cave Wonder'.",
            "why_visit": "Most spectacular cave in Zhangjiajie area with enormous chambers. Cool escape from heat/rain. The underground waterfall and Dragon Palace hall are highlights.",
            "ticket_price_eur": 13.5,
            "recommended_duration_hours": 2.5,
            "opening_hours": "08:00-17:00",
            "best_time": "Rainy days or hot afternoons - indoor attraction. Less crowded in early morning or late afternoon.",
            "how_to_get_there": "8km from Wulingyuan town, bus or taxi (10 min)",
            "tips": [
              "Guided tour mandatory (included) - 2-hour route through 3km of chambers",
              "Includes boat ride on underground river",
              "Temperature constant 16°C - bring jacket or sweater",
              "Paths well-lit and maintained but can be slippery - non-slip shoes essential",
              "Highlight: Stalagmite 'Pillar of the Dragon Palace' (27m tall)",
              "Photography allowed but low light challenging - bring camera with good ISO",
              "Good rainy-day backup option - completely weather-proof",
              "Less impressive than Reed Flute Cave in Guilin but still worth visit if time permits"
            ]
          }
        ]
      },
      {
        "day": 16,
        "location": "Hong Kong",
        "attractions": [
          {
            "name": "Victoria Peak",
            "name_chinese": "太平山",
            "type": "viewpoint",
            "description": "Hong Kong's highest point (552m) offering panoramic views of the city skyline, Victoria Harbour, and surrounding islands. Accessible via historic Peak Tram funicular railway since 1888.",
            "why_visit": "THE iconic Hong Kong experience with unbeatable city views. Day or night, the skyline vistas are spectacular. Peak Tram ride is historic attraction itself.",
            "ticket_price_eur": 12,
            "recommended_duration_hours": 2.5,
            "opening_hours": "Peak Tram: 07:00-midnight, Peak Tower: 10:00-23:00",
            "best_time": "Sunset (18:00-19:00) to see transition from day to night, or clear mornings for best visibility. Avoid foggy/rainy days.",
            "how_to_get_there": "Peak Tram from Central (MTR Central Station, Exit J2, 10-minute walk to Lower Terminus)",
            "tips": [
              "Peak Tram round-trip (12 EUR) + Sky Terrace 428 (6 EUR) combo tickets available online",
              "Book tickets online to skip long queues (can be 1-2 hours wait during peak)",
              "For free views, walk to Peak Circle Walk or Lugard Road - no entry fee, better views than paid observation decks",
              "Hike down via Old Peak Road (45 min to Mid-Levels, 1.5 hours to Central) - beautiful forest trail",
              "Evening visit: arrive 17:00 for sunset, stay for night skyline (most spectacular)",
              "Weather check essential - clouds/fog ruin the experience entirely",
              "Alternative: Take bus #15 up (cheaper but no funicular experience)",
              "Peak Tower has restaurants and shops - Peak Galleria mall has dining options"
            ]
          },
          {
            "name": "Tsim Sha Tsui Promenade & Symphony of Lights",
            "name_chinese": "尖沙咀海滨长廊 & 幻彩咏香江",
            "type": "waterfront",
            "description": "Iconic waterfront promenade along Victoria Harbour with unobstructed views of Hong Kong Island skyline. Nightly Symphony of Lights show (world's largest permanent light-and-sound show).",
            "why_visit": "Best spot to appreciate Hong Kong's famous skyline. Free world-class light show every night. Perfect for photography, leisurely walks, and people-watching.",
            "ticket_price_eur": 0,
            "recommended_duration_hours": 2,
            "opening_hours": "24/7 (Symphony of Lights show at 20:00 nightly)",
            "best_time": "Late afternoon into evening (17:00-21:00) for golden hour, sunset, and light show at 20:00",
            "how_to_get_there": "MTR Tsim Sha Tsui Station, Exit E or F",
            "tips": [
              "Symphony of Lights show at 20:00 sharp every night (13 minutes) - FREE from promenade",
              "Best viewing spot: Avenue of Stars or Tsim Sha Tsui waterfront (not crowded)",
              "Avenue of Stars: Hong Kong's Walk of Fame with Bruce Lee statue and handprints",
              "Combine with Victoria Peak (across harbor) for comparison perspectives",
              "Star Ferry to Hong Kong Island (0.35 EUR) - historic harbor crossing, departs nearby",
              "Photography: wide-angle lens essential for skyline, tripod useful for night shots",
              "Weekends can be crowded but promenade is long enough to find space",
              "Nearby: Hong Kong Cultural Centre, Museum of Art, Space Museum, Harbor City mall"
            ]
          },
          {
            "name": "Lantau Island: Big Buddha & Ngong Ping 360",
            "name_chinese": "大屿山: 天坛大佛 & 昂坪360",
            "type": "cultural_site",
            "description": "Giant bronze Buddha (34m tall) atop Ngong Ping plateau, accessed via spectacular 5.7km cable car journey over mountains and sea. Includes Po Lin Monastery and traditional village.",
            "why_visit": "Hong Kong's spiritual center with impressive Big Buddha statue. The cable car ride offers stunning views. Escape from urban Hong Kong to mountain tranquility.",
            "ticket_price_eur": 27,
            "recommended_duration_hours": 4,
            "opening_hours": "Cable car: 10:00-18:00 (weekdays), 09:00-18:30 (weekends). Big Buddha: 10:00-17:30",
            "best_time": "Weekday mornings (10:00-11:00) to avoid cable car queues, clear weather essential for views",
            "how_to_get_there": "MTR to Tung Chung Station (东涌站), then Ngong Ping 360 cable car terminal adjacent",
            "tips": [
              "Cable car round-trip: Standard Cabin (27 EUR) or Crystal Cabin with glass floor (38 EUR)",
              "Book online 1 day in advance to skip ticket queues (can be very long)",
              "Big Buddha visit FREE but climb 268 steps to reach base",
              "Po Lin Monastery offers vegetarian meal sets (8-12 EUR)",
              "Wisdom Path nearby - wooden pillars with Heart Sutra inscriptions, 15-min walk",
              "Ngong Ping Village at cable car top station - shops, restaurants, cultural exhibits",
              "Alternative hike: Lantau Trail from Tung Chung to Big Buddha (2-3 hours, strenuous)",
              "Combine with Tai O fishing village visit (bus 21, 20 min from Ngong Ping) - traditional stilt houses",
              "Weather critical - fog/clouds common, cable car may close in high winds"
            ]
          },
          {
            "name": "Central-Mid-Levels Escalators & SoHo",
            "name_chinese": "中环至半山自动扶梯 & 荷南美食区",
            "type": "urban_experience",
            "description": "World's longest outdoor covered escalator system (800m, 135m elevation gain) connecting Central to Mid-Levels. Passes through SoHo (South of Hollywood Road) dining and bar district.",
            "why_visit": "Unique urban transport system that's also tourist attraction. Explore SoHo's eclectic dining scene and street art. Great way to experience Hong Kong's vertical living.",
            "ticket_price_eur": 0,
            "recommended_duration_hours": 2,
            "opening_hours": "Down: 06:00-10:00, Up: 10:30-midnight",
            "best_time": "Evening (18:00-21:00) for SoHo dining and bar scene, or late morning for upward journey",
            "how_to_get_there": "MTR Central Station, Exit D2, walk to Des Voeux Road starting point",
            "tips": [
              "FREE to ride - just step on (operates as public transport)",
              "Upward direction only after 10:30 (downward only before) - plan accordingly",
              "Hop on/off at different levels to explore neighborhoods: Soho, Mid-Levels",
              "SoHo area: international restaurants, bars, art galleries - great for dinner",
              "Hollywood Road antique shops and art galleries worth browsing",
              "Man Mo Temple (文武庙) midway point - beautiful Taoist temple (free entry)",
              "Street art and murals in surrounding lanes - good photography",
              "Combine with exploration of Sheung Wan, PMQ creative hub, Tai Kwun"
            ]
          }
        ]
      },
      {
        "day": 17,
        "location": "Hong Kong",
        "attractions": [
          {
            "name": "Dragon's Back Hike",
            "name_chinese": "龙脊远足径",
            "type": "hiking_trail",
            "description": "Rated Asia's best urban hike by TIME magazine. 8.5km trail along mountain ridge offering 360-degree views of ocean, beaches, islands, and city. Part of Hong Kong Trail Section 8.",
            "why_visit": "Best combination of accessible hiking and spectacular scenery in Hong Kong. Panoramic coastal views with Hong Kong's skyline in distance. Beach access at end.",
            "ticket_price_eur": 0,
            "recommended_duration_hours": 3.5,
            "opening_hours": "24/7 (daylight hiking recommended)",
            "best_time": "Autumn-spring (Oct-April) for comfortable temperatures, early morning (8:00-11:00) to avoid midday heat. Avoid summer humidity.",
            "how_to_get_there": "Bus 9 from Shau Kei Wan MTR to To Tei Wan (土地湾) stop, start at Shek O Road trailhead",
            "tips": [
              "Moderate difficulty - some steep sections but well-maintained trail",
              "Full hike: Shek O Road → Dragon's Back Ridge → Big Wave Bay Beach (3-4 hours)",
              "Bring: plenty of water (2L), sun protection, snacks, proper hiking shoes",
              "Finish at Big Wave Bay Beach - swim reward (bring swimsuit)",
              "Bus 9 from beach back to Shau Kei Wan MTR",
              "Weather check essential - no shade on exposed ridge, dangerous in thunderstorms",
              "Best views from Dragon's Back ridgeline - can see Stanley, Shek O, islands",
              "Alternative exit: Continue to Shek O village (additional 1 hour) for seafood lunch",
              "Weekends can be busy but trail wide enough"
            ]
          },
          {
            "name": "Temple Street Night Market",
            "name_chinese": "庙街夜市",
            "type": "night_market",
            "description": "Hong Kong's most atmospheric night market in Yau Ma Tei, famous from countless Hong Kong films. Street stalls selling everything from clothes to antiques, plus dai pai dong eateries.",
            "why_visit": "Quintessential Hong Kong experience. Vibrant atmosphere with fortune tellers, street opera performers, and authentic local food. Great for souvenirs and people-watching.",
            "ticket_price_eur": 0,
            "recommended_duration_hours": 2,
            "opening_hours": "18:00-midnight (best 20:00-23:00)",
            "best_time": "Evening after dinner (20:00-22:00) when fully set up and most vibrant",
            "how_to_get_there": "MTR Jordan Station, Exit A or Yau Ma Tei Station, Exit C",
            "tips": [
              "Bargaining expected - start at 50% of asking price for clothing/souvenirs",
              "Try dai pai dong (大排档) street food: claypot rice, seafood, noodles",
              "Fortune tellers and face readers - cultural experience (20-50 HKD)",
              "Cantonese opera performances some evenings - check schedule",
              "Watch for pickpockets in crowded areas - keep valuables secure",
              "Compare prices between stalls before buying",
              "Combine with nearby Jade Market (opens daytime) and Tin Hau Temple",
              "Cash only at most stalls - ATMs nearby on Nathan Road"
            ]
          },
          {
            "name": "Chi Lin Nunnery & Nan Lian Garden",
            "name_chinese": "志莲净苑 & 南莲园池",
            "type": "temple_garden",
            "description": "Tang Dynasty-style Buddhist wooden temple complex (rebuilt 1990s) with adjacent classical Chinese garden. Serene oasis in urban Kowloon with traditional architecture and landscaping.",
            "why_visit": "Peaceful escape from Hong Kong's chaos. Exquisite traditional architecture built without nails. Beautiful classical garden with lotus ponds and rockeries. Free entry.",
            "ticket_price_eur": 0,
            "recommended_duration_hours": 1.5,
            "opening_hours": "Nunnery: 09:00-16:30, Garden: 07:00-21:00",
            "best_time": "Morning (9:00-11:00) for peaceful atmosphere and good photography light, or lotus flowering season (June-Aug)",
            "how_to_get_there": "MTR Diamond Hill Station, Exit C2 (2-minute walk)",
            "tips": [
              "Completely FREE - both nunnery and garden",
              "Chi Lin Nunnery built entirely with wood in Tang Dynasty style - no nails used",
              "Respectful behavior and dress required (active religious site)",
              "Nan Lian Garden perfect for photography - classical Chinese garden design",
              "Vegetarian restaurant in nunnery (Long Men) - excellent dim sum (10-15 EUR pp)",
              "Quiet contemplation zones - maintain silence in meditation areas",
              "Lotus ponds beautiful in summer, bonsai collection year-round",
              "Can combine with nearby Wong Tai Sin Temple (MTR one stop away)",
              "Early morning best for avoiding crowds and peaceful photography"
            ]
          }
        ]
      },
      {
        "day": 18,
        "location": "Macau",
        "attractions": [
          {
            "name": "Ruins of St. Paul's",
            "name_chinese": "大三巴牌坊",
            "type": "historical_site",
            "unesco_heritage": true,
            "description": "Iconic facade of 16th-century St. Paul's College and Church. Only the grand stone facade survived 1835 fire. Symbol of Macau and UNESCO World Heritage site.",
            "why_visit": "Macau's most famous landmark and essential photo stop. Impressive Renaissance-Baroque architecture with intricate carvings. Gateway to Historic Centre of Macau.",
            "ticket_price_eur": 0,
            "recommended_duration_hours": 1,
            "opening_hours": "24/7 (Museum of Sacred Art behind ruins: 09:00-18:00, closed Tuesdays)",
            "best_time": "Early morning (7:00-9:00) before tour groups, or late afternoon for softer light",
            "how_to_get_there": "Bus 3/3X/4/8A/18A/19/26A/33 to Ruins of St. Paul's stop, or 15-minute walk from Senado Square",
            "tips": [
              "FREE to visit facade and surrounding area",
              "Climb stairs to facade for detailed carvings - Biblical scenes and Jesuit symbols",
              "Museum of Sacred Art behind ruins (free) - religious artifacts and history",
              "Crypt below (free entry) contains remains of Vietnamese and Japanese martyrs",
              "Surrounding area: UNESCO Historic Centre with Portuguese colonial buildings",
              "Food street adjacent - try pork chop bun, serradura (sawdust pudding)",
              "Very crowded 10:00-17:00 - arrive early or late for photos without crowds",
              "Combine with Fortaleza do Monte and Macau Museum (uphill, 5 min walk)"
            ]
          },
          {
            "name": "Senado Square",
            "name_chinese": "议事亭前地",
            "type": "cultural_district",
            "unesco_heritage": true,
            "description": "Heart of Macau's Historic Centre with Portuguese wave-patterned mosaic pavement, pastel colonial buildings, and fountain. UNESCO World Heritage zone center.",
            "why_visit": "Most photogenic square in Macau with Portuguese colonial architecture. Central hub for exploring old town. Excellent shopping, dining, and Portuguese egg tarts.",
            "ticket_price_eur": 0,
            "recommended_duration_hours": 1.5,
            "opening_hours": "24/7 (shops 10:00-22:00)",
            "best_time": "Early morning (8:00-10:00) for empty square photos, or evening (18:00-20:00) when illuminated",
            "how_to_get_there": "Bus 3/4/8A/18A/19/26A/33 to Senado Square, central Macau location",
            "tips": [
              "Starting point for Historic Centre walking tour",
              "Portuguese wave-pattern pavement (calçada portuguesa) - beautiful for photos",
              "Leal Senado Building (民政总署大楼) - Portuguese colonial architecture, free garden courtyard",
              "Lord Stow's Bakery nearby - famous Portuguese egg tarts (pastel de nata), 1.50 EUR each",
              "Shopping streets radiate from square - St. Dominic's Street, Rua de S. Paulo",
              "St. Dominic's Church (玫瑰堂) adjacent - beautiful yellow facade, free entry",
              "Christmas and Chinese New Year decorations spectacular",
              "Can get very crowded on weekends - weekday mornings more pleasant"
            ]
          },
          {
            "name": "A-Ma Temple",
            "name_chinese": "妈阁庙",
            "type": "religious_site",
            "unesco_heritage": true,
            "description": "Macau's oldest temple (1488), dedicated to Mazu (sea goddess). Macau's name derives from 'A-Ma-Gau' (Bay of A-Ma). UNESCO World Heritage site with multiple pavilions.",
            "why_visit": "Historic Taoist temple predating Portuguese arrival. Beautiful hillside setting with stone carvings, prayer halls, and incense smoke. Essential for understanding Macau's name origin.",
            "ticket_price_eur": 0,
            "recommended_duration_hours": 0.75,
            "opening_hours": "07:00-18:00",
            "best_time": "Morning (8:00-10:00) for incense atmosphere and fewer crowds",
            "how_to_get_there": "Bus 1/2/5/6B/10/10A/11/18/21A/26/28B to A-Ma Temple stop",
            "tips": [
              "FREE entry - donations welcome",
              "Six main areas ascending hillside - Prayer Hall, Hall of Benevolence, Hall of Guanyin",
              "Active worship site - respectful behavior required",
              "Legend: Portuguese asked name of place, locals thought they meant the temple, said 'A-Ma-Gau'",
              "Beautiful stone carvings and calligraphy on rocks",
              "Incense coils hanging from ceiling - atmospheric photos (morning light best)",
              "Combine with nearby Maritime Museum (3 EUR) - 2-minute walk",
              "Festival on Mazu's birthday (23rd day of 3rd lunar month) - very crowded but cultural experience"
            ]
          },
          {
            "name": "The Venetian Macao",
            "name_chinese": "澳门威尼斯人",
            "type": "casino_resort",
            "description": "World's largest casino and Asia's largest building. Replica Venetian canals with gondola rides, painted sky ceiling, and over 350 shops. Massive luxury resort complex.",
            "why_visit": "Spectacular over-the-top architecture. Even if not gambling, the canal shoppes, painted ceilings, and gondola rides are worth experiencing. Free to explore.",
            "ticket_price_eur": 0,
            "recommended_duration_hours": 2,
            "opening_hours": "24/7",
            "best_time": "Afternoon (14:00-17:00) to avoid morning tour groups, or evening for entertainment",
            "how_to_get_there": "Free shuttle buses from Macau Ferry Terminal, Border Gate, Taipa Ferry Terminal, and major hotels",
            "tips": [
              "FREE to walk around - no entry fee for non-gamblers",
              "Grand Canal Shoppes - three Venetian canal sections with painted sky ceiling",
              "Gondola rides (17 EUR for 15 minutes) - gondoliers sing Italian songs",
              "Must be 21+ to enter casino floor - bring ID",
              "Shopping: luxury brands, high-street fashion, souvenirs",
              "Multiple food courts and restaurants - from cheap to Michelin-starred",
              "Free performances in St. Mark's Square replica",
              "Air-conditioned escape from Macau heat/humidity",
              "Combine with Parisian Macao (half-scale Eiffel Tower, adjacent, free shuttle)"
            ]
          },
          {
            "name": "Macau Tower",
            "name_chinese": "澳门旅游塔",
            "type": "observation_tower",
            "description": "338m observation tower with viewing deck, revolving restaurant, and extreme sports including world's highest bungee jump (233m) and skywalk. Designed by New Zealand architect.",
            "why_visit": "Panoramic views of Macau, Zhuhai, and Pearl River Delta. Home to world records in bungee jumping and skywalk. Thrill-seekers can try extreme activities.",
            "ticket_price_eur": 19,
            "recommended_duration_hours": 1.5,
            "opening_hours": "10:00-21:00 (weekdays), 09:00-21:00 (weekends)",
            "best_time": "Clear days essential for views, sunset (18:00-19:00) for transition to night lights",
            "how_to_get_there": "Free shuttle bus from major hotels/ferry terminal, or bus 9A/18/23/26/32 to Macau Tower",
            "tips": [
              "Observation deck entry: 19 EUR (includes levels 58 and 61)",
              "Bungee jump (233m) - 380 EUR, world's highest commercial jump",
              "Skywalk X (233m) - 100 EUR, walk around outer rim of tower",
              "360° Café - affordable option for views while dining (no observation deck ticket needed if dining)",
              "Revolving restaurant (level 60) - expensive but includes views",
              "Weather critical - fog/clouds common, check before visiting",
              "Extreme activities need advance booking - popular with Chinese tourists",
              "Photography best from outdoor observation deck (level 61)"
            ]
          },
          {
            "name": "Coloane Village",
            "name_chinese": "路环村",
            "type": "village",
            "description": "Traditional fishing village on Coloane Island, Macau's southern area. Narrow lanes, seafood restaurants, Chapel of St. Francis Xavier, and Lord Stow's Bakery original location.",
            "why_visit": "Escape Macau's casino chaos to peaceful village life. Authentic Portuguese-Macanese culture, original egg tart bakery, and seaside charm. See 'old Macau'.",
            "ticket_price_eur": 0,
            "recommended_duration_hours": 2,
            "opening_hours": "24/7 (village), shops 09:00-18:00",
            "best_time": "Weekday mornings (9:00-12:00) for quiet village atmosphere, or lunch for seafood",
            "how_to_get_there": "Bus 15/21A/25/26A to Coloane Village terminal (30-40 min from Macau Peninsula)",
            "tips": [
              "Lord Stow's Bakery ORIGINAL location - best Portuguese egg tarts in Macau (1.50 EUR)",
              "Chapel of St. Francis Xavier - yellow colonial church, beautiful for photos",
              "Tam Kung Temple (谭公庙) - small seaside temple dedicated to sea god",
              "Seafood restaurants along waterfront - lunch recommended (10-20 EUR per person)",
              "Black sand beach (Hac Sa Beach) nearby - bus 25 or walk 2km",
              "Much quieter and more authentic than Macau Peninsula",
              "Village small - can cover on foot in 1-2 hours",
              "Combine with Hac Sa Beach visit for half-day trip"
            ]
          },
          {
            "name": "Taipa Houses Museum",
            "name_chinese": "龙环葡韵住宅式博物馆",
            "type": "museum",
            "unesco_heritage": true,
            "description": "Five mint-green colonial Portuguese houses (1921) showcasing Macanese lifestyle. Museum of Macanese family life, now UNESCO World Heritage zone. Iconic pastel-colored photo op.",
            "why_visit": "Most photogenic spot in Macau with pastel green houses and lotus pond. Insight into Portuguese-Macanese upper-class life. Free entry to beautiful colonial architecture.",
            "ticket_price_eur": 0,
            "recommended_duration_hours": 1,
            "opening_hours": "10:00-19:00 (closed Mondays)",
            "best_time": "Late afternoon (16:00-18:00) for golden light on green facades, weekdays less crowded",
            "how_to_get_there": "Bus 11/15/22/28A/30/33/34 to Carmo Zone stop, or walk from Taipa Village (10 min)",
            "tips": [
              "Completely FREE entry to all five houses",
              "Each house has different theme: Macanese home, traditions, exhibitions",
              "Lotus pond in front - reflection photos of green houses (Instagram favorite)",
              "Best photos from raised platform overlooking houses and pond",
              "Combine with Taipa Village exploration - 10-minute walk",
              "Museum shop sells Macanese cultural books and souvenirs",
              "Air-conditioned museum - good respite from heat",
              "Nearby: Macau Giant Panda Pavilion (5 EUR, 15-minute walk)"
            ]
          }
        ]
      }
    ]
  }
}