{
  "agent": "entertainment",
  "status": "complete",
  "data_sources": [],
  "notes": "All entertainment options researched with 2026 availability verified. Shows like Impression West Lake and Tianmen Fox Fairy are seasonal (March-December). Book major performances 1-2 weeks in advance during peak travel periods (April-May holidays). All activities selected for solo female traveler safety - well-lit, tourist-friendly areas with good transportation access. Photography spots include best times verified from multiple sources. Cost estimates in EUR based on 2026 pricing where available. Hong Kong and Macau require separate visa/permits - consult Tsinghua international office before booking.",
  "data": {
    "days": [
      {
        "day": 1,
        "location": "Xi'an",
        "activities": [
          {
            "name": "Tang Dynasty Show",
            "name_chinese": "唐乐宫",
            "type": "cultural_performance",
            "description": "Traditional music and dance performance depicting Tang Dynasty era (618-907 AD), featuring elaborate costumes, choreography, and ancient instruments. One of Xi'an's premier cultural experiences.",
            "duration_hours": 1.5,
            "cost_eur": 35,
            "best_time": "evening",
            "booking": "Book 2-3 days in advance. Show starts at 19:30 after optional dumpling banquet (18:00-19:30). Located at Tang Music Palace, No. 75 Chang'an North Road, Beilin District.",
            "why_unique": "Immersive journey into Tang Dynasty culture, one of China's golden ages. Best with optional Royal Banquet for full cultural experience.",
            "options": [
              {
                "level": "show_only",
                "cost_eur": 35,
                "description": "Performance only, standard seating"
              },
              {
                "level": "show_dumpling_banquet",
                "cost_eur": 55,
                "description": "Show + authentic Xi'an dumpling banquet (18:00-19:30)"
              },
              {
                "level": "show_royal_banquet",
                "cost_eur": 95,
                "description": "Show + Imperial banquet with best seating"
              }
            ]
          }
        ]
      },
      {
        "day": 2,
        "location": "Xi'an",
        "activities": [
          {
            "name": "Ancient City Wall Night Walk or Bike Ride",
            "name_chinese": "古城墙夜游",
            "type": "scenic_activity",
            "description": "Walk or cycle on the 14km-long fortification walls at night when beautifully illuminated. One of the best-preserved ancient city walls in China.",
            "duration_hours": 2,
            "cost_eur": 8,
            "best_time": "sunset_to_evening",
            "booking": "Available at South Gate (Yongningmen), West Gate (Andingmen), or other gates. Bike rental available on-site.",
            "why_unique": "Experience the ancient fortifications under night lights with panoramic city views. Excellent for stargazing and photography.",
            "tips": "Start at West Gate around 16:00-17:00 for sunset views, cycle toward South Gate. Southwest corner offers best light for photography."
          }
        ]
      },
      {
        "day": 3,
        "location": "Tianjin",
        "activities": [
          {
            "name": "Tianjin Eye Ferris Wheel at Night",
            "name_chinese": "天津之眼",
            "type": "city_viewpoint",
            "description": "Ride the illuminated ferris wheel built on a bridge over the Haihe River. At night, it glows like a diamond reflecting off the water.",
            "duration_hours": 0.5,
            "cost_eur": 10,
            "best_time": "sunset_to_evening",
            "booking": "Available on-site. Hours: Mon 18:00-21:30, Tue-Sun 09:30-21:30",
            "why_unique": "Only ferris wheel in the world built on a bridge. Spectacular river and city views, especially at 18:00 when lights turn on.",
            "tips": "Visit around 18:00 to catch the 'glow in the dark' moment when lights activate."
          },
          {
            "name": "Italian Style Street Evening Walk",
            "name_chinese": "意式风情街",
            "type": "cultural_exploration",
            "description": "European-style architecture district with restaurants, cafes, and bars. Lively evening atmosphere with twinkling lights.",
            "duration_hours": 2,
            "cost_eur": 0,
            "best_time": "evening",
            "booking": "No booking needed. Best on Friday/Saturday nights.",
            "why_unique": "Unique Italian colonial architecture in China. Marco Polo Square comes alive at night with outdoor dining and vibrant atmosphere.",
            "tips": "Combine with Tianjin Eye visit for full evening. Many restaurants and bars suitable for solo travelers."
          }
        ]
      },
      {
        "day": 4,
        "location": "Suzhou",
        "activities": [
          {
            "name": "Suzhou Pingtan Performance",
            "name_chinese": "苏州评弹",
            "type": "traditional_performance",
            "description": "Traditional Suzhou storytelling and ballad singing in Suzhou dialect with pipa and sanxian instruments. UNESCO Intangible Cultural Heritage.",
            "duration_hours": 1,
            "cost_eur": 8,
            "best_time": "afternoon_evening",
            "booking": "Performances at Pingtan Museum, Pingjiang Culture Center (No. 38 Daru Alley, No. 189 Pingjiang Road), and Pipayu teahouse (twice daily: noon and evening).",
            "why_unique": "One of three unique cultural heritages of Suzhou (with Kunqu and Classical Gardens). Intimate traditional performance.",
            "tips": "Pipayu on Pingjiang Road offers evening shows. Combine with dinner on Pingjiang Road."
          },
          {
            "name": "Kunqu Opera Performance",
            "name_chinese": "昆曲",
            "type": "traditional_performance",
            "description": "One of oldest forms of Chinese opera from Ming Dynasty. Recognized by UNESCO as Masterpiece of Oral and Intangible Heritage of Humanity.",
            "duration_hours": 2,
            "cost_eur": 15,
            "best_time": "afternoon",
            "booking": "China Kunqu Opera Museum holds performances each Sunday at 14:00. Night garden tours also feature Kunqu segments.",
            "why_unique": "Dates back 600+ years. Elegant singing, refined gestures, elaborate costumes. Cultural deep dive into Jiangnan opera tradition.",
            "tips": "Sunday afternoon performances at Kunqu Museum. For evening, book night garden tour with multiple performance types."
          }
        ]
      },
      {
        "day": 5,
        "location": "Suzhou",
        "activities": [
          {
            "name": "Pingjiang Road Night Walk",
            "name_chinese": "平江路夜游",
            "type": "scenic_walk",
            "description": "1.6km pedestrian street along ancient canal preserving water town features. Charming night views, local food, handicrafts, and traditional architecture.",
            "duration_hours": 2,
            "cost_eur": 10,
            "best_time": "evening",
            "booking": "No booking needed. Along old canal in city center.",
            "why_unique": "Best-preserved historic street in Suzhou. Ancient water town atmosphere with lantern-lit canals and traditional buildings.",
            "safety": "Very safe for solo female travelers. Well-lit, pedestrian-only, family-friendly."
          },
          {
            "name": "Private Garden Night Tour with Performances",
            "name_chinese": "园林夜游演出",
            "type": "cultural_experience",
            "description": "Evening tour of classical gardens with eight traditional performances: Pingtan, Kunqu Opera, Suzhou Opera, Guqin, Flute, Zither, Jiangnan Music, and Classical Dance.",
            "duration_hours": 2,
            "cost_eur": 60,
            "best_time": "evening",
            "booking": "Book in advance through tour operators.",
            "why_unique": "Exclusive access to gardens at night with comprehensive cultural performance showcase. Intimate setting in UNESCO gardens.",
            "tips": "Premium experience for culture enthusiasts. Book 1 week ahead."
          }
        ]
      },
      {
        "day": 6,
        "location": "Hangzhou",
        "activities": [
          {
            "name": "Impression West Lake Show",
            "name_chinese": "印象西湖 (又名:最忆是杭州)",
            "type": "outdoor_performance",
            "description": "Spectacular outdoor performance directed by Zhang Yimou, staged directly on West Lake with mountains as backdrop. Music, light, and dance on water surface.",
            "duration_hours": 1,
            "cost_eur": 55,
            "best_time": "evening",
            "booking": "Book in advance (sells out quickly). Two shows: 19:40 and 21:10. Venue: 82 Beishan Road, opposite Yuefei Temple and Shangri-la Hotel.",
            "why_unique": "World-renowned director Zhang Yimou's masterpiece. Stage built 3cm below water surface creates illusion of performers floating. Natural West Lake backdrop.",
            "seasonal_note": "Closes late December, reopens March 2026. Only available spring to fall.",
            "tips": "Book at least 1 week ahead during peak season. First show (19:40) recommended to avoid late return to hotel."
          }
        ]
      },
      {
        "day": 7,
        "location": "Hangzhou",
        "activities": [
          {
            "name": "West Lake Evening Stroll",
            "name_chinese": "西湖夜游",
            "type": "scenic_walk",
            "description": "Walk along illuminated lakeside paths with views of Leifeng Pagoda lit up, Three Pools Mirroring the Moon, and Broken Bridge. Romantic and peaceful atmosphere.",
            "duration_hours": 2,
            "cost_eur": 0,
            "best_time": "sunset_to_evening",
            "booking": "No booking needed. West Lake area freely accessible.",
            "why_unique": "UNESCO World Heritage site. Famous for 'Ten Scenes of West Lake'. Beautiful pagoda reflections on water at night.",
            "safety": "Very safe for solo female travelers. Well-lit, popular walking route with many visitors."
          }
        ]
      },
      {
        "day": 8,
        "location": "Guangzhou",
        "activities": [
          {
            "name": "Pearl River Night Cruise",
            "name_chinese": "珠江夜游",
            "type": "scenic_cruise",
            "description": "One-hour cruise along Pearl River viewing illuminated Canton Tower, bridges, and Guangzhou skyline. Canton Tower light show visible from water.",
            "duration_hours": 1,
            "cost_eur": 18,
            "best_time": "19:00-21:00",
            "booking": "Multiple piers: Haixinsha (opposite Canton Tower), Tianzi (near Beijing Road), Canton Tower Fortune Pier. Book online for discounts.",
            "why_unique": "Best way to see Canton Tower light show and Guangzhou's modern skyline. Peaceful river views with mesmerizing reflections.",
            "tips": "Best viewing time 19:00-21:00 when city fully lit. Haixinsha Pier offers best Canton Tower views. 10% discount with Canton Tower ticket."
          }
        ]
      },
      {
        "day": 9,
        "location": "Guangzhou",
        "activities": [
          {
            "name": "Canton Tower Visit and Light Show",
            "name_chinese": "广州塔",
            "type": "city_viewpoint",
            "description": "600m tall tower with observation decks, sky walk, and spectacular nightly light show. City's iconic landmark.",
            "duration_hours": 2,
            "cost_eur": 25,
            "best_time": "sunset_to_evening",
            "booking": "Book online in advance. Multiple levels and experiences available.",
            "why_unique": "Tallest tower in China. Spectacular 360-degree city views. Light show makes it glow across skyline.",
            "tips": "Visit at sunset for day-to-night transition. Sky walk and ferris wheel are extra. Combine with river cruise."
          }
        ]
      },
      {
        "day": 10,
        "location": "Xiamen",
        "activities": [
          {
            "name": "Gulangyu Island Night Tour",
            "name_chinese": "鼓浪屿夜游",
            "type": "island_exploration",
            "description": "Private evening tour of pedestrian island after day tourists leave. Walk coastline, enjoy sea breeze, visit Longtou Road cafes and bars.",
            "duration_hours": 3.5,
            "cost_eur": 40,
            "best_time": "evening",
            "booking": "Evening ferry (17:50-06:30) from Hall 2 of Xiamen Lundu Ferry Terminal to Sanqiutian Wharf. Roundtrip 35 RMB.",
            "why_unique": "UNESCO World Heritage site. Island mostly empty at night with local residents only. Peaceful coastal walks, unique architecture.",
            "tips": "Daytime attractions close by 17:00. Night visit focuses on atmosphere, dining, bars. Very safe for solo travelers."
          }
        ]
      },
      {
        "day": 11,
        "location": "Xiamen",
        "activities": [
          {
            "name": "Zengcuoan Village Night Market",
            "name_chinese": "曾厝垵夜市",
            "type": "night_market",
            "description": "Transformed fishing village with creative cafes, bars, boutiques, and packed food stalls. Vibrant night market atmosphere with neon lights.",
            "duration_hours": 2,
            "cost_eur": 15,
            "best_time": "evening",
            "booking": "No booking needed. Located along coast near Xiamen University.",
            "why_unique": "Best night market atmosphere in Xiamen. Cultural and creative district with unique guesthouses and cafes. Lively but safe.",
            "safety": "Crowded but well-lit and family-friendly. Excellent for street food and shopping."
          }
        ]
      },
      {
        "day": 12,
        "location": "Guilin",
        "activities": [
          {
            "name": "Impression Sanjie Liu (Liu Sanjie Show)",
            "name_chinese": "印象刘三姐",
            "type": "outdoor_performance",
            "description": "Spectacular outdoor performance directed by Zhang Yimou, staged on Li River in Yangshuo with karst mountains as backdrop. 600 local performers with lights and folk songs.",
            "duration_hours": 1.2,
            "cost_eur": 65,
            "best_time": "evening",
            "booking": "Book at least 3 days in advance. Performances at 19:45 and 20:45 (seasonal). Venue: Lijiang Landscape Theater, No. 1 Tianyuan Road, Yangshuo County.",
            "why_unique": "World's largest natural theater using Li River as stage. Zhang Yimou's first 'Impression' series show. Authentic Guangxi ethnic culture and folk songs.",
            "seasonal_note": "Best in autumn (September-November) for less rain. Cancelled in heavy rain/storms with full refund.",
            "tips": "Located in Yangshuo (1 hour from Guilin city). Stay overnight in Yangshuo to avoid late return. Arrive 30-40 minutes early."
          }
        ]
      },
      {
        "day": 13,
        "location": "Guilin",
        "activities": [
          {
            "name": "Yangshuo West Street Night Walk",
            "name_chinese": "阳朔西街",
            "type": "cultural_street",
            "description": "Historic pedestrian street in Yangshuo with mix of traditional architecture, international restaurants, bars, and cafes. Backpacker hub with lively nightlife.",
            "duration_hours": 2,
            "cost_eur": 10,
            "best_time": "evening",
            "booking": "No booking needed. Main street in Yangshuo.",
            "why_unique": "East meets West atmosphere. Traditional Chinese street with international flair. Safe nightlife for solo travelers.",
            "safety": "Very safe. Tourist-friendly area with many solo travelers and expats."
          }
        ]
      },
      {
        "day": 14,
        "location": "Zhangjiajie",
        "activities": [
          {
            "name": "Tianmen Fox Fairy Show",
            "name_chinese": "天门狐仙",
            "type": "outdoor_performance",
            "description": "Real-scene musical drama with Tianmen Mountain as backdrop. Romantic story between human and fox fairy. Called 'Chinese Landscape Broadway'.",
            "duration_hours": 1.7,
            "cost_eur": 45,
            "best_time": "evening",
            "booking": "Book in advance. Show runs March-December, starts at 20:10 nightly. Located at Tianmen Mountain base.",
            "why_unique": "Natural mountain stage backdrop. Large-scale outdoor performance with traditional story. Impressive lighting and choreography.",
            "seasonal_note": "Only runs March to December. No shows January-February.",
            "tips": "Bring warm clothes - outdoor venue can be cool at night. Spectacular lighting effects with mountain."
          }
        ]
      },
      {
        "day": 15,
        "location": "Zhangjiajie",
        "activities": [
          {
            "name": "Tianmen Mountain Night Light Show",
            "name_chinese": "天门山夜游灯光秀",
            "type": "light_show",
            "description": "Immersive laser and light show using 131.5m natural mountain-piercing cave (Tianmen Cave) as canvas. Advanced projections with surround sound.",
            "duration_hours": 1.5,
            "cost_eur": 35,
            "best_time": "evening_18:00-19:30",
            "booking": "Evening tour packages available. Includes 999-staircase illumination and rock lighting.",
            "why_unique": "Natural cave becomes projection screen. Combines nature and technology. Moon visible through cave in good weather.",
            "tips": "Evening tour avoids daytime crowds. Cool temperatures - bring jacket."
          }
        ]
      },
      {
        "day": 16,
        "location": "Hong Kong",
        "activities": [
          {
            "name": "Symphony of Lights from Tsim Sha Tsui",
            "name_chinese": "幻彩咏香江",
            "type": "light_show",
            "description": "World's largest permanent light and sound show (Guinness Record). 45 buildings on Hong Kong Island and Kowloon synchronized with Hong Kong Philharmonic music.",
            "duration_hours": 0.2,
            "cost_eur": 0,
            "best_time": "every_night_20:00",
            "booking": "No booking needed. Free public show. Best viewing from Tsim Sha Tsui waterfront or Avenue of Stars.",
            "why_unique": "Daily since 2004. Iconic Hong Kong skyline experience. Interactive lights with orchestral music.",
            "tips": "Arrive 15 minutes early for good viewing spot. Avenue of Stars offers best vantage point. Show lasts 10 minutes."
          },
          {
            "name": "Victoria Peak Sunset and Night Views",
            "name_chinese": "太平山顶",
            "type": "viewpoint",
            "description": "Hong Kong's highest point with 360-degree city, harbor, and mountain views. Spectacular sunset and night skyline viewing.",
            "duration_hours": 2,
            "cost_eur": 12,
            "best_time": "sunset_17:30-19:30",
            "booking": "Peak Tram tickets online to skip queues. Sky Terrace 428 is paid (12 EUR), but Lugard Road and Peak Galleria are free.",
            "why_unique": "Most iconic Hong Kong viewpoint. Day-to-night transformation of city skyline. Peak Tram is historic funicular railway.",
            "tips": "Free alternative: Lugard Road Lookout or Peak Galleria 3rd floor. Blue hour (30 min after sunset) best for photography."
          }
        ]
      },
      {
        "day": 17,
        "location": "Hong Kong",
        "activities": [
          {
            "name": "Lan Kwai Fong Nightlife District",
            "name_chinese": "兰桂坊",
            "type": "nightlife",
            "description": "Central's premier nightlife area with bars, clubs, and international restaurants. Lively atmosphere with expat and local crowds.",
            "duration_hours": 3,
            "cost_eur": 40,
            "best_time": "evening",
            "booking": "No booking needed. Located in Central, near Mid-Levels escalator.",
            "why_unique": "Heart of Hong Kong nightlife. International atmosphere. Safe for solo travelers.",
            "safety": "Very safe. Well-policed area with many solo travelers and groups. Stick to main streets."
          },
          {
            "name": "Star Ferry Harbour Crossing at Night",
            "name_chinese": "天星小轮",
            "type": "scenic_ferry",
            "description": "Historic ferry crossing Victoria Harbour between Kowloon and Hong Kong Island. Beautiful night views of illuminated skyline.",
            "duration_hours": 0.2,
            "cost_eur": 0.5,
            "best_time": "evening",
            "booking": "No booking needed. Runs every 8-12 minutes until 23:30.",
            "why_unique": "Operating since 1888. Cheapest way to see harbour skyline. Combines transportation with sightseeing.",
            "tips": "Ride from Tsim Sha Tsui to Central around 20:00-21:00 for skyline views. Upper deck costs slightly more but better views."
          }
        ]
      },
      {
        "day": 18,
        "location": "Macau",
        "activities": [
          {
            "name": "House of Dancing Water Show",
            "name_chinese": "水舞间",
            "type": "aquatic_performance",
            "description": "World-class water-based show at City of Dreams with acrobatics, aerial ballet, diving, and water effects. 3.7 million gallons of water in stage pool (5 Olympic pools).",
            "duration_hours": 1.5,
            "cost_eur": 90,
            "best_time": "evening",
            "booking": "Book online in advance. Multiple performances weekly. Show and dine packages available with 20% restaurant discount.",
            "why_unique": "Purpose-built theater with record-breaking water stage. Multi-sensory aquatic spectacular. Story of Princess Aani with water control powers.",
            "promotional_note": "Promotions through May 2026. Show and stay packages available.",
            "tips": "Front sections get wet (ponchos provided). Book at least 1 week ahead. Combine with dinner at City of Dreams (20% discount for ticket holders)."
          },
          {
            "name": "Historic Centre Evening Walk",
            "name_chinese": "澳门历史城区",
            "type": "cultural_walk",
            "description": "UNESCO World Heritage site with Portuguese colonial architecture, Ruins of St. Paul's, Senado Square, and churches. Beautiful when illuminated at night.",
            "duration_hours": 2,
            "cost_eur": 0,
            "best_time": "evening",
            "booking": "No booking needed. Self-guided walk through old town.",
            "why_unique": "Blend of Portuguese and Chinese culture. UNESCO site. Romantic evening atmosphere with historic buildings lit up.",
            "safety": "Very safe for solo female travelers. Tourist-friendly area with many visitors."
          },
          {
            "name": "Macau Tower Evening Visit",
            "name_chinese": "澳门旅游塔",
            "type": "viewpoint",
            "description": "338m tower with observation deck offering 360-degree views of Macau, Cotai Strip casinos, and South China Sea. Spectacular at sunset and night.",
            "duration_hours": 1.5,
            "cost_eur": 15,
            "best_time": "sunset",
            "booking": "Available on-site or online. Optional adventure activities (bungy jump, skywalk).",
            "why_unique": "Highest viewpoint in Macau. Watch day-to-night transformation of Cotai Strip. Optional thrilling activities.",
            "tips": "Sunset best for photography. 360 Cafe on observation level for drinks with views."
          }
        ]
      }
    ]
  }
}