{
  "agent": "shopping",
  "status": "complete",
  "data": {
    "days": [
      {
        "day": 1,
        "shopping": [
          {
            "name": "Zhongyang Street (中央大街)",
            "location": "Zhongyang Street No.1, Harbin",
            "cost": 50,
            "type": "Pedestrian Shopping Street",
            "notes": "Historic Russian-style street. Shop for: Russian souvenirs (Matryoshka dolls, amber jewelry), winter gear (fur hats, scarves), local snacks (Harbin red sausage). Most shops open 9am-9pm. Bargaining possible in small shops but not in branded stores.",
            "search_results": [
              {
                "skill": "gaode-maps",
                "type": "poi_search",
                "url": "https://www.amap.com/place/B0FFGDXA74",
                "display_text": "高德地图"
              }
            ]
          },
          {
            "name": "Harbin Souvenir Shop (尔滨之恋冰箱贴纪念品)",
            "location": "West 12th Street No.24, Harbin",
            "cost": 30,
            "type": "Souvenir Shop",
            "notes": "Specializes in Harbin-themed magnets, postcards, and small gifts. Good for affordable mementos. Price range: 10-50 RMB per item. Cash and WeChat Pay accepted.",
            "search_results": [
              {
                "skill": "gaode-maps",
                "type": "poi_search",
                "url": "https://www.amap.com/place/B0KAU9O9SF",
                "display_text": "高德地图"
              }
            ]
          }
        ]
      },
      {
        "day": 2,
        "shopping": []
      },
      {
        "day": 3,
        "shopping": [
          {
            "name": "Ancient Culture Street (古文化街)",
            "location": "Ancient Culture Street, Nankai District, Tianjin",
            "cost": 80,
            "type": "Cultural Shopping Street",
            "notes": "UNESCO-recognized street for traditional Chinese crafts. Shop for: Clay figurines (泥人张), paper cuts, traditional paintings, Chinese knots, vintage items. Open 9am-6pm. Bargaining expected (start at 50-60% of asking price). Avoid overpriced 'antiques' - most are reproductions.",
            "search_results": [
              {
                "skill": "gaode-maps",
                "type": "poi_search",
                "url": "https://www.amap.com/place/B00160DB75",
                "display_text": "高德地图"
              }
            ]
          },
          {
            "name": "Ancient Culture Market (古文化市场)",
            "location": "Ancient Culture Street, Tianjin",
            "cost": 50,
            "type": "Traditional Market",
            "notes": "Indoor market with multiple vendors selling calligraphy, seals, tea sets, and folk art. More concentrated selection than the street. Prices: 20-500 RMB depending on item. Best for authentic local crafts.",
            "search_results": [
              {
                "skill": "gaode-maps",
                "type": "poi_search",
                "url": "https://www.amap.com/place/B0FFJJ7B0K",
                "display_text": "高德地图"
              }
            ]
          }
        ]
      },
      {
        "day": 4,
        "shopping": [
          {
            "name": "Muslim Quarter (回民街)",
            "location": "Muslim Quarter, Xi'an",
            "cost": 60,
            "type": "Street Market",
            "notes": "Famous food street with shops selling terracotta warrior replicas, local snacks, Islamic crafts. Shop for: Mini terracotta warriors (20-200 RMB), shadow puppets, Chinese painting scrolls. Open late into evening (6am-11pm). Heavily touristy - check quality before buying. Terracotta replicas: buy from established shops, not street vendors.",
            "search_results": [
              {
                "skill": "gaode-maps",
                "type": "poi_search",
                "url": "https://www.amap.com/place/B0L2Y1X4RD",
                "display_text": "高德地图"
              }
            ]
          }
        ]
      },
      {
        "day": 5,
        "shopping": [
          {
            "name": "Tang Dynasty Ever-Bright City (大唐不夜城)",
            "location": "South of Giant Wild Goose Pagoda, Xi'an",
            "cost": 70,
            "type": "Cultural Shopping District",
            "notes": "Modern cultural complex with Tang Dynasty theme. Shop for: Tang-style cultural products, silk scarves, artisan tea sets, cultural creative products. Open 10am-10pm (night market extends to 11pm). Higher quality but also higher prices than Muslim Quarter. Good for: gift-worthy items, modern interpretations of traditional crafts.",
            "search_results": []
          }
        ]
      },
      {
        "day": 6,
        "shopping": [
          {
            "name": "Pingjiang Road Ancient Street (平江路古街)",
            "location": "Pingjiang Road, Suzhou",
            "cost": 60,
            "type": "Historic Shopping Street",
            "notes": "Canal-side historic street with boutique shops. Shop for: Suzhou embroidery, silk products, traditional fans, local snacks. Open 9am-9pm. Less touristy than Shantang Street. Silk items: 100-500 RMB for quality pieces. Look for 'Suzhou Silk Museum' certification for authentic silk.",
            "search_results": []
          },
          {
            "name": "Suzhou Silk Museum Shop",
            "location": "2001 Renmin Road, Suzhou",
            "cost": 150,
            "type": "Museum Shop",
            "notes": "Official museum shop with certified authentic Suzhou silk products. Shop for: Silk scarves (150-800 RMB), silk bedding, traditional embroidery. Open 9am-5pm (closed Mondays). Higher prices but guaranteed quality and authenticity. Good for serious silk purchases. Tax-free shopping available for tourists.",
            "search_results": [
              {
                "skill": "gaode-maps",
                "type": "poi_search",
                "url": "https://www.amap.com/place/B020001288",
                "display_text": "高德地图"
              }
            ]
          }
        ]
      },
      {
        "day": 7,
        "shopping": [
          {
            "name": "Longjing Tea Village (龙井村)",
            "location": "Longjing Village, West Lake Scenic Area, Hangzhou",
            "cost": 200,
            "type": "Tea Village",
            "notes": "Famous for authentic West Lake Longjing tea. Shop for: Longjing green tea (200-2000 RMB/500g depending on grade). Visit family-run tea houses for tea tasting before buying. Spring harvest (pre-Qingming) is most expensive and best quality. Avoid street vendors - buy from established tea houses with licenses. Ask for vacuum-sealed packaging. Average good quality: 400-600 RMB/500g.",
            "search_results": []
          },
          {
            "name": "Hefang Street (河坊街)",
            "location": "Hefang Street, Hangzhou",
            "cost": 60,
            "type": "Historic Commercial Street",
            "notes": "Traditional shopping street near West Lake. Shop for: Hangzhou silk products, tea sets, chopsticks, fans, local snacks (walnut cake, osmanthus candy). Open 9am-10pm. Mix of tourist shops and local businesses. Longjing tea also available but more touristy than village. Bargaining acceptable in small shops.",
            "search_results": []
          }
        ]
      },
      {
        "day": 8,
        "shopping": [
          {
            "name": "West Street (阳朔西街)",
            "location": "West Street, Yangshuo, Guilin",
            "cost": 50,
            "type": "Tourist Shopping Street",
            "notes": "Main shopping street in Yangshuo. Shop for: Minority handicrafts, batik cloth, stone carvings, tea, local snacks. Open 9am-late. Very touristy - bargain hard (start at 40% of asking price). Quality varies greatly. Best for: casual souvenirs, not high-value items.",
            "search_results": []
          }
        ]
      },
      {
        "day": 9,
        "shopping": [
          {
            "name": "Guilin Specialty Shops (桂林特产伴手礼)",
            "location": "West Street No.204, Yangshuo",
            "cost": 80,
            "type": "Specialty Store",
            "notes": "Chain store selling Guilin specialties. Shop for: Osmanthus candy, chili sauce, Guilin rice noodle sauce, dried fruits, tea. Fixed prices (no bargaining). Open 9am-10pm. Good for: packaged gifts, food products. Price range: 20-150 RMB per item. Vacuum-packed for travel.",
            "search_results": [
              {
                "skill": "gaode-maps",
                "type": "poi_search",
                "url": "https://www.amap.com/place/B0I335XW8V",
                "display_text": "高德地图"
              }
            ]
          }
        ]
      },
      {
        "day": 10,
        "shopping": [
          {
            "name": "Zhangjiajie Specialty Stores",
            "location": "Wuling Road, Zhangjiajie City",
            "cost": 70,
            "type": "Specialty Stores",
            "notes": "Multiple specialty stores in city center. Shop for: Tujia brocade (土家织锦), Zhangjiajie tea, preserved wild vegetables, dried mushrooms, local honey. Open 9am-9pm. Recommended stores: 湘品汇特产超市 (Xiangpinhui) - fixed prices, quality products. Avoid: shops with aggressive touts near tourist sites. Price range: 30-200 RMB per item.",
            "search_results": [
              {
                "skill": "gaode-maps",
                "type": "poi_search",
                "url": "https://www.amap.com/place/B0LDFCSSOG",
                "display_text": "高德地图"
              }
            ]
          }
        ]
      },
      {
        "day": 11,
        "shopping": [
          {
            "name": "Beijing Road Pedestrian Street (北京路步行街)",
            "location": "Beijing Road, Yuexiu District, Guangzhou",
            "cost": 100,
            "type": "Shopping District",
            "notes": "Major shopping street with mix of local and international brands. Shop for: Cantonese herbal products, tea, dried seafood, fashion. Open 10am-10pm. Modern shopping experience with department stores and boutiques. Good for: mainstream shopping, not traditional crafts. Price range varies from budget to luxury.",
            "search_results": [
              {
                "skill": "gaode-maps",
                "type": "poi_search",
                "url": "https://www.amap.com/place/B00141RH20",
                "display_text": "高德地图"
              }
            ]
          },
          {
            "name": "Shamian Island Shops",
            "location": "Shamian Island, Guangzhou",
            "cost": 50,
            "type": "Boutique Shopping",
            "notes": "Historic colonial island with boutique shops and cafes. Shop for: Artisan coffee, small crafts, postcards. More atmosphere than shopping variety. Good for: leisurely browsing, not major purchases. Open 10am-8pm.",
            "search_results": []
          }
        ]
      },
      {
        "day": 12,
        "shopping": [
          {
            "name": "Dongmen Pedestrian Street (东门老街)",
            "location": "Luohu District, Shenzhen",
            "cost": 80,
            "type": "Commercial Shopping District",
            "notes": "Budget shopping area popular with locals. Shop for: Electronics, fashion, accessories. Open 10am-10pm. Bargaining possible in small shops. More affordable than Hong Kong. Watch for knockoffs - check quality carefully. Good for: budget fashion finds, electronic accessories.",
            "search_results": [
              {
                "skill": "google-maps",
                "type": "place_search",
                "url": "https://maps.google.com/?cid=14388673932645582414",
                "display_text": "Google Maps"
              }
            ]
          },
          {
            "name": "Temple Street Night Market (庙街夜市)",
            "location": "Temple Street, Yau Ma Tei, Kowloon, Hong Kong",
            "cost": 60,
            "type": "Night Market",
            "notes": "Famous night market. Shop for: Souvenirs, cheap electronics, clothing, jade jewelry. Opens 6pm-midnight. Heavy bargaining culture (start at 40% of asking price). Watch for fake goods. Good for: Hong Kong memorabilia, casual souvenirs. Atmosphere is part of the experience.",
            "search_results": []
          }
        ]
      },
      {
        "day": 13,
        "shopping": [
          {
            "name": "Harbour City",
            "location": "Canton Road, Tsim Sha Tsui, Hong Kong",
            "cost": 200,
            "type": "Luxury Shopping Mall",
            "notes": "One of Hong Kong's largest luxury malls. Shop for: International designer brands, watches, cosmetics. Open 10am-10pm. Fixed prices (no bargaining). Good for: duty-free luxury shopping, high-end purchases. Price range: luxury tier. Tax benefits compared to mainland China.",
            "search_results": [
              {
                "skill": "google-maps",
                "type": "place_search",
                "url": "https://maps.google.com/?cid=11923618932726473814",
                "display_text": "Google Maps"
              }
            ]
          },
          {
            "name": "Senado Square (议事亭前地)",
            "location": "Largo do Senado, Macau",
            "cost": 100,
            "type": "Shopping District",
            "notes": "Historic square surrounded by shops. Shop for: Portuguese egg tarts, almond cookies, Portuguese wine, Portuguese imported goods, Macau souvenirs. Famous bakeries: Koi Kei (钜记), Lord Stow's (安德鲁). Open 10am-10pm. Fixed prices in major stores. Good for: Macau food gifts, Portuguese products. Buy egg tarts fresh (don't transport long distances).",
            "search_results": [
              {
                "skill": "google-maps",
                "type": "place_search",
                "url": "https://maps.google.com/?cid=16665451313394024695",
                "display_text": "Google Maps"
              }
            ]
          },
          {
            "name": "The Venetian Macao Shops",
            "location": "Estrada da Baia de Nossa Senhora da Esperanca, Macau",
            "cost": 150,
            "type": "Shopping Mall",
            "notes": "Luxury resort shopping mall. Shop for: International brands, jewelry, cosmetics, Portuguese wine. Open 10am-11pm. Indoor 'Venice' canals theme. Fixed prices. Good for: luxury shopping, browsing. Higher-end than street shops. Duty-free advantages.",
            "search_results": []
          }
        ]
      }
    ]
  },
  "notes": "Shopping budget recommendations are per location/area, not per item. Budget allocation: Days 1-10 (China domestic): focus on local specialties and crafts (30-80 USD/day). Days 11-13 (Guangzhou-Hong Kong-Macau): higher budget for luxury shopping if interested (100-200 USD/day). Currency: 1 USD = ~7.2 RMB. Payment: WeChat Pay/Alipay widely accepted in mainland China; cash/credit cards better in Hong Kong/Macau. Bargaining culture: Expected in markets and small shops (start 40-60% of asking price), not in malls or established stores. Quality check: For silk, tea, and jade, buy from established shops with certifications to avoid fakes. Luggage: Consider shipping purchases if buying heavy items (tea, ceramics) - many shops offer international shipping. Customs: Check airline baggage limits. No restrictions on tea, silk, or crafts for personal use. Avoid antiques (require special permits). Shopping timing: Don't schedule heavy shopping on travel days. Best shopping days: Days 3 (Tianjin), 6 (Suzhou silk), 7 (Hangzhou tea), 13 (Macau food gifts)."
}
